[{"pageContent":"Updated: April 6th, 2023 Compared to the previous versions, GA4 is a completely revamped platform. New interface, new tag template in Google Tag Manager, new data model, new steps to configure, etc. This raises many questions: where to get started? What should be the optimal setup? If you are unsure how to get started, you’ve come to the right place. Because in this Google Analytics 4 tutorial, I’ll show you the exact first steps, plus I’ll give you some further directions. Table of contents + Show table of contents + What are you going to learn in this blog post? Chapter I: Install Google Analytics 4 with Google Tag Manager #1.1. If you are currently using the older version of GA #1.2. Create a Google Analytics 4 property & Data Stream #1.3. Install Google Analytics 4 with Google Tag Manager #1.4. DebugView in Google Analytics 4 #1.5. Publish your changes in Google Tag Manager #1.6. Google Analytics 4 Realtime reports #1.7. Frequently asked questions Chapter II: Track Events with Google Analytics 4 #2.1. Bye-bye to Event Category, Action, and Label #2.2. Four categories of events in Google Analytics 4 #2.2.1 Category #1. Automatically tracked events #2.2.2 Category #2. Enhanced Measurement #2.2.3 Category #3. Recommended events #2.2.4 Category #4. Custom Events #2.3. Test your events in GA4 #2.4. Where can I find event data in GA4 reports? #2.5. How to plan your events in GA4 #2.6. Event limits in Google Analytics 4 Chapter III: Track Conversions with Google Analytics 4 #3.1. What is a conversion in general? #3.2. Goodbye, goals. Hello, conversions! #3.3. Predefined Conversions #3.4. Conversions that can be switched on #3.5. Create events and mark them as conversions #3.6. Or try planning a better event naming convention #3.7. Check the data in Google Analytics DebugView #3.8. Where can I see the conversion data in GA4 reports? Chapter IV: Reports in Google Analytics 4 Final Words Video tutorial In addition to this blog post, I have also recorded a video tutorial on my Youtube Channel. You will learn the most if you consume both types of content: read this blog post and watch the video. They complement each other. What are you going to learn in this blog post? I have split the article into four main chunks: How to properly install Google Analytics 4 How to track events with Google Analytics 4 (and where to find that data in the interface) How to track conversions with Google Analytics 4 (and where to find that data in the interface) Resources on how to build reports with Google Analytics 4 We have lots of things to cover, so if you don’t have enough time now, you can bookmark this Google Analytics 4 tutorial and come back later. Want to learn much more about Google Analytics 4? GA4 is a complex tool with many things to learn/master. And even if you know how to configure certain things, how can you get insights and value? That’s what I will teach you in my Google Analytics 4 course. I will show you how to configure everything properly, collect data, build reports, and, most importantly, get value out of your data. If you want to learn more, take a look here. <img class=\"alignnone size-full wp-image-19182\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/07/Enroll-in-GA4-course-in-content-banner.jpg\" alt=\"Google analytics 4 course\" width=\"989\" height=\"432\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/07/Enroll-in-GA4-course-in-content-banner.jpg 989w, https://www.analyticsmania.com/wp-content/uploads/2022/07/Enroll-in-GA4-course-in-content-banner-300x131.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/07/Enroll-in-GA4-course-in-content-banner-768x335.jpg 768w\" sizes=\"(max-width: 989px) 100vw, 989px\" /> Chapter I: Install Google Analytics 4 with Google Tag Manager In this chapter, we’ll look at one of the basic (but fundamental) topics – how to install Google Analytics 4. We’ll do that with Google Tag Manager (using GTAG instead? Then watch this). Here’s the process of how to install Google Analytics 4 with Google Tag Manager: Create a new GA4 property Create a data stream Copy the Measurement ID Create a Google Analytics 4 Configuration tag Paste the Measurement ID and set the tag to fire on All Pages Preview/test the new tag Publish the changes in Google Tag Manager #1.1. If you are currently using the older version of GA What if you already use Universal Analytics (the older version of GA) on your website? If that old version is still working, you can continue using it (for now). But at the same time, you should implement GA4 as soon as possible. Both versions can co-exist on a website at the same time. And now, let’s learn how to install Google Analytics 4. #1.2. Create a Google Analytics 4 property & Data Stream If you want to create a new Google Analytics 4 property (and you are not upgrading to GA4), then go to the Admin section of your Google Analytics interface (by clicking the Admin at the bottom-left corner) and then (in the Property section) click Create Property. <img class=\"alignnone size-full wp-image-17139\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/ga4-admin-min.jpg\" alt=\"\" width=\"921\" height=\"702\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/ga4-admin-min.jpg 921w, https://www.analyticsmania.com/wp-content/uploads/2021/08/ga4-admin-min-300x229.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/ga4-admin-min-768x585.jpg 768w\" sizes=\"(max-width: 921px) 100vw, 921px\" /> Then enter the name of your property. It might be the name of your website, of your company, a brand, etc. Choose your company’s country, reporting time zone, and the main currency that your business operates in. <img class=\"alignnone size-full wp-image-21586 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture3.jpg\" alt=\"\" width=\"562\" height=\"335\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture3.jpg 562w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture3-300x179.jpg 300w\" sizes=\"(max-width: 562px) 100vw, 562px\" /> Then press Next, and answer several questions. Then you will need to select your business objectives. Based on these choices, the reports that you will have in the interface will change too. To make things simpler right now, select Get baseline reports. <img class=\"alignnone wp-image-21587 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture4.jpg\" alt=\"\" width=\"473\" height=\"195\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture4.jpg 539w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture4-300x124.jpg 300w\" sizes=\"(max-width: 473px) 100vw, 473px\" /> Click Create. The next step to complete is to configure your first data stream. It is a data source from which events will be sent to your Google Analytics 4 property. You can have multiple data sources in a single property. For example, three web properties, 1 for an Android app and 1 for an iOS app. But in most cases where you track websites, it is enough to have just one web stream (even if you track several websites with it). In this blog post, I will focus on a Web stream. Select it. <img class=\"alignnone size-full wp-image-17141\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/select-web-data-stream-ga4-min.jpg\" alt=\"\" width=\"1100\" height=\"535\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/select-web-data-stream-ga4-min.jpg 1100w, https://www.analyticsmania.com/wp-content/uploads/2021/08/select-web-data-stream-ga4-min-300x146.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/select-web-data-stream-ga4-min-768x374.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2021/08/select-web-data-stream-ga4-min-1024x498.jpg 1024w\" sizes=\"(max-width: 1100px) 100vw, 1100px\" /> Then enter the URL of your website (for example, https://www.mywebsite.com). Note that the protocol (https) is already selected. After that, enter the name of your website. When you create a web data stream in Google Analytics 4, you can enable/disable Enhanced Measurement. It is designed to help marketers get as many events in the reports as possible without the need to cooperate with developers or configure them in Google Tag Manager. <img class=\"wp-image-17142 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/enhanced-measurement.jpg\" alt=\"\" width=\"725\" height=\"532\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/enhanced-measurement.jpg 855w, https://www.analyticsmania.com/wp-content/uploads/2021/08/enhanced-measurement-300x220.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/enhanced-measurement-768x563.jpg 768w\" sizes=\"(max-width: 725px) 100vw, 725px\" /> By default, this feature is enabled and will automatically track the following events: Page view (event name: page_view) Scroll (event name: scroll) Outbound link click (event name: click with the parameter outbound: true) Site search (event name: view_search_results) Video Engagement (events: video_start, video_progress, video_complete) File Download (event name: file_download) Form submissions (event name: form_start and form_submit) If you want, you can disable/enable events individually. You can do that by clicking the gear icon in the Enhanced Measurement section and then clicking the toggle buttons. <img class=\"alignnone wp-image-17144 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/configure-enhanced-measurement.jpg\" alt=\"\" width=\"560\" height=\"237\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/configure-enhanced-measurement.jpg 709w, https://www.analyticsmania.com/wp-content/uploads/2021/08/configure-enhanced-measurement-300x127.jpg 300w\" sizes=\"(max-width: 560px) 100vw, 560px\" /> When you’re ready, press the Create stream button. #1.3. Install Google Analytics 4 with Google Tag Manager When you create a data stream (web), you will see a Measurement ID. <img class=\"alignnone size-full wp-image-17145\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-measurement-id.jpg\" alt=\"\" width=\"1080\" height=\"433\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-measurement-id.jpg 1080w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-measurement-id-300x120.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-measurement-id-768x308.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-measurement-id-1024x411.jpg 1024w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" /> Copy it. We’ll need to use it in Google Tag Manager. By the way, if you ever get lost in the GA4 interface and you need to revisit this page, go to Admin > Data Streams > choose your most recently created stream, and then you will return to the same window that I have displayed in the screenshot above. Then go to your Google Tag Manager container (if you haven’t worked with it, here’s a tutorial on how to get started) > Tags > New and choose GA4 configuration. In the Measurement ID field, enter the ID that you copied in the GA4 interface. Keep the Send a page view event when this configuration loads enabled if you want to track page views automatically. <img class=\" wp-image-17146 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-config-tag-in-google-tag-manager.jpg\" alt=\"\" width=\"375\" height=\"589\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-config-tag-in-google-tag-manager.jpg 467w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-config-tag-in-google-tag-manager-191x300.jpg 191w\" sizes=\"(max-width: 375px) 100vw, 375px\" /> Usually, that’s ok keep it enabled but in some situations, e.g., on single-page applications, it is more recommended to disable the pageview checkbox and create just a standalone configuration tag. You can read more about that here. In the Triggering section, select All Pages and then name the tag, e.g., GA4 – Pageview. #1.4. DebugView in Google Analytics 4 Please memorize this part of the blog post. I will refer to DebugView multiple times throughout the entire article because it’s essential to ensure that your data was properly sent to Google Analytics 4. Enable the GTM preview mode to test your changes (you can do that by clicking a big PREVIEW button in the top-right corner of the GTM interface). Once you enable it, you should see the new GA4 tag among the tags that fired. <img class=\"alignnone size-full wp-image-17147\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-tag-in-google-tag-manager-preview-mode.jpg\" alt=\"\" width=\"888\" height=\"664\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-tag-in-google-tag-manager-preview-mode.jpg 888w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-tag-in-google-tag-manager-preview-mode-300x224.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-tag-in-google-tag-manager-preview-mode-768x574.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-tag-in-google-tag-manager-preview-mode-627x470.jpg 627w\" sizes=\"(max-width: 888px) 100vw, 888px\" /> When you configure your events, it’s time to test them. The primary feature built for debugging GA 4 data is the DebugView section. You can find it by going to Admin > DebugView on the left side of the GA4 interface. Click it. <img class=\"aligncenter wp-image-20496\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3.jpg\" sizes=\"(max-width: 489px) 100vw, 489px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3.jpg 592w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3-300x213.jpg 300w\" alt=\"ga4 debugview in the admin section\" width=\"489\" height=\"348\" /> Most likely, you will not see any data there (yet). That’s because that data in the DebugView is visible ONLY when the debug mode in GA4 is enabled. Do not mix this with the GTM Preview and Debug mode. They are two different beasts. To enable the debug mode in GA4, you have several options (any of them will work): Enable the GA debugger Chrome extension OR send a debug_mode parameter together with an event OR have enabled Google Tag Manager’s Preview mode on a page you’re debugging. To me, this one is the most convenient. In the case of the first option, install the extension here, and then click its icon (so you can see the ON ribbon). From this moment, you will start seeing your events coming into DebugView. The other option is to send a debug_mode parameter with every event you wish to see in the DebugView. In Google Tag Manager, you can do that by opening the GA4 Configuration tag and adding the following parameter: <img class=\"alignnone wp-image-17149 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/debug_mode-in-google-analytics-4-tag.jpg\" alt=\"\" width=\"583\" height=\"474\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/debug_mode-in-google-analytics-4-tag.jpg 689w, https://www.analyticsmania.com/wp-content/uploads/2021/08/debug_mode-in-google-analytics-4-tag-300x244.jpg 300w\" sizes=\"(max-width: 583px) 100vw, 583px\" /> If the debug_mode parameter contains any value, the event will be seen in DebugView. If you are using a hardcoded gtag.js, here are the instructions for including the debug_mode parameter. But since we are working with Google Tag Manager, having the GTM Preview mode enabled automatically sets the debug_mode to true. Thus the data will start appearing in the GA4 DebugView. When you start seeing data in the DebugView, you can click on every event, and then a list of parameters will be displayed. Click on that parameter to see the value that GA4 received. Now that is some granular debugging! <img class=\"wp-image-17151 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/ga4-debug-view-close-view.jpg\" alt=\"\" width=\"610\" height=\"421\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/ga4-debug-view-close-view.jpg 846w, https://www.analyticsmania.com/wp-content/uploads/2021/08/ga4-debug-view-close-view-300x207.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/ga4-debug-view-close-view-768x530.jpg 768w\" sizes=\"(max-width: 610px) 100vw, 610px\" /> However, I have noticed some delays between the event happening on a website and then appearing in DebugView. Sometimes, I have to wait for several minutes until the data come in. That’s a bit unfortunate, and hopefully, the team behind Google Analytics 4 will improve this in the future. Sometimes, refreshing DebugView’s page helps too. Also, ensure you have selected the correct Debug device in the top left corner. <img class=\"alignnone wp-image-17152 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/choose-device-in-ga4-debug-view.jpg\" alt=\"\" width=\"433\" height=\"265\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/choose-device-in-ga4-debug-view.jpg 586w, https://www.analyticsmania.com/wp-content/uploads/2021/08/choose-device-in-ga4-debug-view-300x184.jpg 300w\" sizes=\"(max-width: 433px) 100vw, 433px\" /> If multiple visitors have enabled the debug view (e.g. they all have enabled the GA Debugger extension), you will see multiple devices there, and it might require some time to find yourself. This especially applies to my blog, when many of my readers have enabled the GA Debugger Extension, and I have to guess which device (out of the other 15) is mine 🙂 Anyway, once you start seeing data in DebugView, things will look like this. <img class=\"alignnone wp-image-17154 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/user_engagement-in-google-analytics-4-debugview.jpg\" alt=\"\" width=\"618\" height=\"466\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/user_engagement-in-google-analytics-4-debugview.jpg 700w, https://www.analyticsmania.com/wp-content/uploads/2021/08/user_engagement-in-google-analytics-4-debugview-300x226.jpg 300w\" sizes=\"(max-width: 618px) 100vw, 618px\" /> #1.5. Publish your changes in Google Tag Manager Once you made sure that the data is coming in and is displayed properly, you should submit your GA4 changes in the GTM container and publish it. You can do that by clicking the SUBMIT button in the top right corner and then completing all the other steps that the user interface asks you to do. <img class=\"wp-image-8253 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2019/05/submit.jpg\" alt=\"\" width=\"243\" height=\"115\" /> After that, you should soon start seeing the new data coming in your real-time reports as well. #1.6. Google Analytics 4 Realtime reports On the left sidebar of the Google Analytics 4 interface, go to Reports > Realtime. This is where you will see the data coming into your reports. Unlike in the previous version (Universal Analytics), the new report offers you capabilities to see the data on a much more granular level. First, you will see a map and a bunch of cards with traffic sources, the most popular events, and the number of users in the last 30 minutes. You can also take a look at the snapshot of an individual user. You can do that by clicking the View user snapshot button in the top right corner. <img class=\" wp-image-17155 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-realtime-reports.jpg\" alt=\"\" width=\"350\" height=\"176\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-realtime-reports.jpg 447w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-realtime-reports-300x150.jpg 300w\" sizes=\"(max-width: 350px) 100vw, 350px\" /> Then, you will see a stream of all events of that particular user, you can click on them (just like in the DebugView) to see things on a more granular level. If you wish to look at another user/visitor, you can click the button here: <img class=\" wp-image-17156 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/switch-to-another-user-snapshot-in-google-analytics-4-interface.jpg\" alt=\"\" width=\"448\" height=\"171\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/switch-to-another-user-snapshot-in-google-analytics-4-interface.jpg 625w, https://www.analyticsmania.com/wp-content/uploads/2021/08/switch-to-another-user-snapshot-in-google-analytics-4-interface-300x115.jpg 300w\" sizes=\"(max-width: 448px) 100vw, 448px\" /> To exit the snapshot, simply press the Exit snapshot button in the top right corner. #1.7. Frequently asked questions Here are some additional questions that you might have that I wanted to address. What if I already have Universal Analytics installed on my site? Universal Analytics (UA) stops collecting tada on June 30th, 2023. This is the deadline until you have to switch to another analytics tool (e.g., GA4). While UA still works, you can have both GA versions installed on the same website. What if I already have Google Analytics 4 tracking code hardcoded in the website’s source code? I would highly recommend implementing GA4 (or any other JavaScript-based marketing/analytics tool) via Google Tag Manager because of its flexibility. Click here to learn more about GTM benefits. But a short version goes like this: your developers should remove the hardcoded tracking code from your website, and you should implement Google Analytics 4 via Google Tag Manager. My Google Tag Manager Course for Beginners covers the process and tips on how to migrate hardcoded tools to Google Tag Manager. If I already have Universal Analytics implemented in Google Tag Manager, should I create a new GTM container for Google Analytics 4? No, you don’t need to create a new GTM container just for Google Analytics 4. Use your existing Google Tag Manager container for the new GA version. Google Analytics 4 requires completely different GA tags, but they can co-exist with Universal Analytics tags in the same container. ====== After you have installed Google Analytics 4 on your website, the next step is implementing event tracking. They are the backbone of your GA setup. Every interaction that you want to measure is an event. And when we move towards conversion tracking, you will learn that conversion in GA4 is just an event with some VIP status. Chapter II: Track Events with Google Analytics 4 After you have installed GA4, it’s time to start collecting additional data. P.S. it might be a good time to bookmark this Google Analytics 4 tutorial. We still have lots to cover and if you don’t have enough time, come back whenever you’re ready again. #2.1. Bye-bye to Event Category, Action, and Label Compared to Universal Analytics, a.k.a. UA (the previous Google Analytics version), the data model in Google Analytics 4 is much more flexible. This means that there are fewer restrictions and required fields/parameters compared to the UA. The most notable difference regarding events is four parameters that you could send together with every event to Universal Analytics (excluding custom dimensions): Event Category (required) Event Action (required) Event Label (optional) Event Value (optional) And when you open the Universal Analytics event reports, you’d first see the Event Category. Then you can click it and drill down deeper (to see action and then label). In Google Analytics 4, the naming convention is much more flexible and solely depends on the person implementing the tracking setup. In GA4, there is a parameter called Event Name, and then everything else depends on what you have planned. If you wish, you can send no additional parameters. Or you can send four additional parameters that better describe the context of that event. For example, let’s say someone filled in your website’s “Request demo” form. You could send the following event: Event name: request_demo product_name: amazing product company_size: 99-250 company_industry: internet and telecom annual_revenue: 50-100M The last four items in the list above are custom parameters you can send together with an event. However, keep in mind that there are some limits regarding the number of custom parameters that you can send with a single event. I will mention them additionally later in this article. While you can come up with any events you want, there are some recommendations that you could follow. But first, let’s look at four event categories in GA4. If you are unsure how to name/structure your events, I will give you some hints later in this e-book + a spreadsheet template. But first, let’s learn about various types/categories of events in Google Analytics 4 and how you can create/modify them. I believe that it’s important to have a good understanding of events in GA4 before we start thinking about the structure. #2.2. Four categories of events in Google Analytics 4 In GA4, events can be split into four categories: Automatically collected events Enhanced Measurement events Recommended events Custom events The process of how you should plan the structure of your events (names and parameters) is by doing the following: Check if the event that you want to track is among the automatically collected events If not, then check if your event is mentioned among the Enhanced Measurement events (e.g., scroll or file_download) If not, then check the recommended events and their naming convention If none of the above categories apply to your events, create a custom event with an event that you want <img class=\"alignnone size-full wp-image-17157 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-event-tracking-flow.jpg\" alt=\"\" width=\"351\" height=\"614\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-event-tracking-flow.jpg 351w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-event-tracking-flow-171x300.jpg 171w\" sizes=\"(max-width: 351px) 100vw, 351px\" /> In the upcoming 4 mini-chapters of this blog post, I will explain where to look and how to find the category of your event. And once you get more familiar with events (and how to configure them), I will share some tips (and a sample spreadsheet) that can help you think about the structure of your events and a naming convention. To sum up, here is the process of how Google Analytics 4 event tracking works: Identify if your event is automatically tracked. If not, then create a GA4 event tag in Google Tag Manager If needed, include events parameters too Check the incoming events in the DebugView of GA4 Register event parameters as custom dimensions Publish all changes in Google Tag Manager Let’s take a closer look at those steps. #2.2.1 Category #1. Automatically tracked events Since I mainly focus on web tracking, the same principle will apply to this guide. There are certain events that GA4 tracks automatically. You can find a full list here. On that list, you will find both app and web events. The list of web events is a bit longer than I’d expected. Enhanced Measurement events are also listed there. For now, let’s temporarily ignore them and focus only on those events that are automatically captured and should not be added to any other event category. The list of website events goes like this: first_visit. This is the first time a user visits a website or launches an app. session_start. When a user engages the app or website and starts a new session , user_engagement. This event is fired 10 seconds after the visitor has stayed on a page. But it also might periodically fire while the app is in the foreground. You can learn more here. I didn’t mention the page_view here because I added it to the Enhanced Measurement section. Also, if you want to see the app events, you can check them here. #2.2.2 Category #2. Enhanced Measurement When you configure a web data stream in Google Analytics 4, you can use Enhanced Measurement. It is designed to help marketers get as many events in the reports as possible without the need to cooperate with developers or configure them in Google Tag Manager. If you go to Admin > Data Streams > Select the web data stream, the following window will open, where you will see a section called Enhanced Measurement. <img class=\"alignnone size-full wp-image-17158\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/enhanced-measurement-2.jpg\" alt=\"\" width=\"1058\" height=\"417\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/enhanced-measurement-2.jpg 1058w, https://www.analyticsmania.com/wp-content/uploads/2021/08/enhanced-measurement-2-300x118.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/enhanced-measurement-2-768x303.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2021/08/enhanced-measurement-2-1024x404.jpg 1024w\" sizes=\"(max-width: 1058px) 100vw, 1058px\" /> By default, this feature is enabled and will automatically track the following events: Page view (event name: page_view) Scroll (event name: scroll) Outbound link click (event name: click with the parameter outbound: true) Site search (event name: view_search_results) Youtube Video Engagement (events: video_start, video_progress, video_complete) File Download (event name: file_download) Form events (event: form_submit, form_start) If you want, you can disable/enable events individually, and you can do that by clicking the gear icon in the Enhanced Measurement section and then clicking the toggle buttons. <img class=\"alignnone wp-image-17144 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/configure-enhanced-measurement.jpg\" alt=\"\" width=\"560\" height=\"237\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/configure-enhanced-measurement.jpg 709w, https://www.analyticsmania.com/wp-content/uploads/2021/08/configure-enhanced-measurement-300x127.jpg 300w\" sizes=\"(max-width: 560px) 100vw, 560px\" /> Also, some events can be customized additionally. Let’s take a quick look at each event and its respective settings. page_view. This event is sent to GA4 when a new page loads or the URL of the page changes without reloading the page (a.k.a. history change events) <img class=\" wp-image-17160 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-enhanced-measurement-pageview.jpg\" alt=\"\" width=\"668\" height=\"261\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-enhanced-measurement-pageview.jpg 793w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-enhanced-measurement-pageview-300x117.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-enhanced-measurement-pageview-768x300.jpg 768w\" sizes=\"(max-width: 668px) 100vw, 668px\" /> scroll. This event is sent to GA4 once per page when a visitor scrolls below the 90% threshold of the page height. Learn more click. This is an event for the outbound link click (when a clicked link redirects a visitor to another domain. Together with this event, an additional parameter outbound (with the value “true”) is sent. The event with this parameter means that there was an outbound link click. Together with this event, a bunch of other parameters is sent: link_classes, link_domain, link_id, link_url. Learn more If your business operates on several domains, you can go to Tagging Settings (of that very same event stream) > Configure your domains and then enter the domains of your business. All the domains listed there will not trigger the outbound link click event. view_search_results. This event will be sent to Google Analytics 4 if the page loads and the URL of the page contains a query parameter, such as q, s, search, query, keyword. But if you want, you can include more (up to 10). Learn more <img class=\"alignnone wp-image-17161 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-enhanced-measurement-pageview-1.jpg\" alt=\"\" width=\"589\" height=\"230\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-enhanced-measurement-pageview-1.jpg 793w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-enhanced-measurement-pageview-1-300x117.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/google-analytics-4-enhanced-measurement-pageview-1-768x300.jpg 768w\" sizes=\"(max-width: 589px) 100vw, 589px\" /> If the address of your website’s search results page looks like this: https://www.yourwebsite.com/search?key=my+search+term, then you should enter the word “key” (without quotation marks in the settings of the search event). If the URL of the search results contains more useful parameters, you can include them as well. For example, if the web address of your search results page looks like this: https://www.yourwebsite.com/search?key=search+term&results=50, you could include the “results” (without quotation marks) in the 2nd field of the configuration. Then this parameter will be automatically tracked by GA4. <img class=\" wp-image-17162 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/additional-query-parameter-in-ga4-site-search.jpg\" alt=\"\" width=\"474\" height=\"311\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/additional-query-parameter-in-ga4-site-search.jpg 571w, https://www.analyticsmania.com/wp-content/uploads/2021/08/additional-query-parameter-in-ga4-site-search-300x197.jpg 300w\" sizes=\"(max-width: 474px) 100vw, 474px\" /> video_start, video_progress, video_complete. Enhanced Measurement is capable of tracking interactions of the embedded Youtube video on your website and then sends “video_…” events to GA4. But those embedded Youtube video players must contain the ?enablejsapi=1 parameter in their URL. And that is not always available on websites. Also, there are many other reasons why Youtube video tracking might not work out of the box. Hence you will need some tweaks. Because of those nuances, I’d say that this automatic video tracking will not work in as many cases as you might think; hence I’d personally vouch for doing that with GTM. file_download. This event is sent to GA4 when a link is clicked and that link contains one of the following file extensions: .pdf, .xls, .xlsx, .doc, .docx, .txt, .rtf, .csv, .exe, .key, .pps, .ppt, .pptx, .7z, .pkg, .rar, .gz, .zip, .avi, .mov, .mp4, .mpe, .mpeg, .wmv, .mid, .midi, .mp3, .wav, .wma. In other words, if the link opens/downloads a file. Currently, it is not possible to update the list with other extensions in the GA4 interface. form_start, form_submit. These events are recorded when the website user interacts successfully and submits a lead form during their session. GA4 records parameters like form_id, form_name, form_destination, and form_submit_text when it is fired. Once you select which events you wish to track, hit Save in the top right corner and then make sure that Enhanced Measurement is enabled (the toggle is blue). From that moment, your Google Analytics 4 will start automatically tracking the events. See chapter #2.6. of this blog post to learn how to check if your data is coming in properly. #2.2.3 Category #3. Recommended events As I have previously mentioned in this blog post, when you are trying to pick the name (and the parameters) for your event, first take a look at automatically tracked events (maybe those events are already being tracked), then check the Enhanced Measurement events. If none of those events cover your case, take a look at the list of recommended events. Check every one of those events and see if any of them match your need. For example, if you want to track when a user logs in, then you will find the “login” event in the list of “All properties”. <img class=\"alignnone size-full wp-image-17163 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/login-event-in-ga4.jpg\" alt=\"\" width=\"909\" height=\"374\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/login-event-in-ga4.jpg 909w, https://www.analyticsmania.com/wp-content/uploads/2021/08/login-event-in-ga4-300x123.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/login-event-in-ga4-768x316.jpg 768w\" sizes=\"(max-width: 909px) 100vw, 909px\" /> Even though Google Analytics 4 data model is very flexible (and you can use a different event name for login, for example, logged_in), Google recommends that you implement recommended events when it makes sense to you. That should help Google Analytics’ reports better understand your data and apply it to their Machine Learning capabilities. However, it is still unclear what those capabilities (related to recommended event names) are. Also, for the majority of those recommended events, Google also recommends some parameters. Speaking of the login event, there is a method parameter. If users can log in to your website via email, google login, facebook login, etc., then it might make sense to track the method as well. <img class=\"size-full wp-image-17164 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/login-method-in-ga4.jpg\" alt=\"\" width=\"887\" height=\"228\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/login-method-in-ga4.jpg 887w, https://www.analyticsmania.com/wp-content/uploads/2021/08/login-method-in-ga4-300x77.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/login-method-in-ga4-768x197.jpg 768w\" sizes=\"(max-width: 887px) 100vw, 887px\" /> If you want to take a look at the example of login tracking, read this. #2.2.4 Category #4. Custom Events Eventually, we reached the last category of events in Google Analytics 4. If you want to send an event that is not mentioned among the automatically tracked events, Enhanced Measurement, or Recommended events, then you can create custom events. The configuration of Custom events is pretty much identical to recommended events. The only difference is that you must create your own event names. For example, if you want to track form submissions of a contact form, the name of the event can be any of these: form_submission contact_form contact_form_submission Or anything else. GA4 is flexible here. So, speaking of custom event tracking, let’s look at the example where we want to measure clicks on menu links on a website. 2.2.4.1. Example of a custom event tracking in Google Analytics 4 Note: menu link click tracking trigger conditions differ on most websites (because of different click classes, IDs, etc.). Try to do your best to apply this example. On a demo website, I have several menu links that I want to track. <img class=\"alignnone wp-image-17165 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/website-menu.jpg\" alt=\"\" width=\"493\" height=\"83\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/website-menu.jpg 569w, https://www.analyticsmania.com/wp-content/uploads/2021/08/website-menu-300x51.jpg 300w\" sizes=\"(max-width: 493px) 100vw, 493px\" /> First, I need to create a trigger with the correct conditions that distinguish any click from a menu link click. Enable Google Tag Manager’s Preview mode and try clicking any of the menu links on a website. Once you do the first link click, you should see the Link Click event in the Preview mode’s left sidebar. <img class=\"alignnone wp-image-17166 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/link-click-in-gtm-preview-mode.jpg\" alt=\"\" width=\"457\" height=\"544\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/link-click-in-gtm-preview-mode.jpg 564w, https://www.analyticsmania.com/wp-content/uploads/2021/08/link-click-in-gtm-preview-mode-252x300.jpg 252w\" sizes=\"(max-width: 457px) 100vw, 457px\" /> If you don’t see it, you should: have at least one Just Links GTM trigger activated on a page or have “File download” or “Outbound links” tracking enabled in your Enhanced Measurement Settings Let’s say that you don’t use Enhanced Measurement in GA4. Go to Google Tag Manager > Triggers > New > Just Links. Keep the trigger set on “All link clicks” and save the trigger. <img class=\"alignnone wp-image-17167 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/all-link-clicks-trigger-in-google-tag-manager.jpg\" alt=\"\" width=\"331\" height=\"416\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/all-link-clicks-trigger-in-google-tag-manager.jpg 412w, https://www.analyticsmania.com/wp-content/uploads/2021/08/all-link-clicks-trigger-in-google-tag-manager-239x300.jpg 239w\" sizes=\"(max-width: 331px) 100vw, 331px\" /> By creating this trigger, we will enable the link-tracking functionality in Google Tag Manager. Then go to Variables > Configure (in the “Built-in Variables” section) and enable all Click-related variables. <img class=\" wp-image-17170 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/built-in-variables-in-google-tag-manager.jpg\" alt=\"\" width=\"368\" height=\"366\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/built-in-variables-in-google-tag-manager.jpg 453w, https://www.analyticsmania.com/wp-content/uploads/2021/08/built-in-variables-in-google-tag-manager-150x150.jpg 150w, https://www.analyticsmania.com/wp-content/uploads/2021/08/built-in-variables-in-google-tag-manager-300x298.jpg 300w\" sizes=\"(max-width: 368px) 100vw, 368px\" /> Refresh the preview mode (by clicking the Preview button once again). <img class=\" wp-image-14466 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151105.637.jpg\" alt=\"\" width=\"438\" height=\"148\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151105.637.jpg 505w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151105.637-300x102.jpg 300w\" sizes=\"(max-width: 438px) 100vw, 438px\" /> Then go to your website and click any of the menu links. Actually, click at least two of them. Return to the preview mode and you should start seeing Link Click events in the preview mode. Click the first Link Click event and go to the Variables tab of the preview mode. <img class=\"alignnone size-full wp-image-14809\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T155633.965.jpg\" sizes=\"(max-width: 1259px) 100vw, 1259px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T155633.965.jpg 1259w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T155633.965-300x178.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T155633.965-768x456.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T155633.965-1024x608.jpg 1024w\" alt=\"\" width=\"1259\" height=\"748\" /> Then click on the second Link Click event. I am currently looking for some variable that I could use to distinguish a menu link click. I don’t want to fire my GA4 event tag on any link click. I want to fire it precisely on a menu link click. After taking a closer look, I see that both links contain the same Click Classes value, site-nav__link site-nav__link–main. By the way, nav means “navigation” in this context. Great! I will use this in my Just Links trigger. <img class=\"size-full wp-image-14812 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160129.763.jpg\" sizes=\"(max-width: 916px) 100vw, 916px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160129.763.jpg 916w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160129.763-300x50.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160129.763-768x127.jpg 768w\" alt=\"\" width=\"916\" height=\"152\" /> Go back to the list of triggers in your GTM container and click the previously created trigger for All Link Clicks. We’ll edit it and add a condition: Click Classes contains site-nav__link–main <img class=\" wp-image-14811 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160022.402.jpg\" sizes=\"(max-width: 599px) 100vw, 599px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160022.402.jpg 703w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160022.402-300x260.jpg 300w\" alt=\"\" width=\"599\" height=\"520\" /> Save the trigger. Now, it’s time to create a Google Analytics 4 event tag. Go to Tags > New > Google Analytics: GA4 Event. Select your existing GA 4 Configuration tag and then enter the event name. Its value is up to you. Any of the following options are perfectly fine: menu_click menu menu_item_click menu click etc. These are just some examples. Since we are working with a custom event, we can name it whatever we want (as long as we follow the limitations of name length, for example). In my case, I used the menu_click event name. But this time, sending just the event name is not very useful. You’d probably want to know which exact menu items are clicked more often. How about we also send the name of the menu item and the URL? We could do that by sending additional event parameters. Even though you could use parameters that are already mentioned in the documentation of the Enhanced Measurement (like link_url and link_text), let’s create two custom parameters (because I just want to show you how to configure them). I am going to pass two parameters, menu_item_url, and menu_item_name. I made these parameter names up, and you can do it too. That’s what the flexibility of the data model offers. To send custom parameters, you must expand the Event Parameters section in the Google Analytics 4 event tag and then click Add Row. <img class=\" wp-image-14855 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150241.525.jpg\" sizes=\"(max-width: 468px) 100vw, 468px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150241.525.jpg 587w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150241.525-300x291.jpg 300w\" alt=\"\" width=\"468\" height=\"454\" /> Enter the name of the first parameter. In my case, that is menu_item_url. In the Value field, I will insert a variable that returns a clicked URL. Luckily, GTM already offers such a variable, it’s called Click URL. Click the Insert Variable button and then select the {{Click URL}} variable. Let’s add another parameter, menu_item_name. For that purpose, GTM offers another built-in variable, {{Click Text}}. Insert it as well. Since visitors of your website can translate your page, {{Click Text}} value will also change, hence you will see a more diverse list of collected values in your GA4 reports. <img class=\" wp-image-14857 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150500.615.jpg\" sizes=\"(max-width: 578px) 100vw, 578px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150500.615.jpg 675w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150500.615-300x287.jpg 300w\" alt=\"\" width=\"578\" height=\"552\" /> If you want to send more parameters, you can do that. You can send up to 25 custom parameters with a single event. Assign the previously created Just Links trigger to this tag. Save the tag. Refresh the GTM Preview mode and click a couple of your menu items. Go back to the Preview mode and click those Link Click events. Check if the GA4 event tags for Menu Link Clicks have fired. <img class=\"alignnone size-full wp-image-14859 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150741.970.jpg\" sizes=\"(max-width: 841px) 100vw, 841px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150741.970.jpg 841w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150741.970-300x257.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T150741.970-768x658.jpg 768w\" alt=\"menu link click event in google analytics 4\" width=\"841\" height=\"721\" /> Now, you will need to go to Google Analytics 4 and check DebugView. IMPORTANT: even though you will see your custom parameters in Real-time reports and DebugView in GA4, you will not be able to see them in other GA4 reports. Unless you register those parameters as custom dimensions in Google Analytics. Read the next chapter of this blog post. 2.2.4.2. Important: Register Custom Definitions This applies to any custom event parameter you send to Google Analytics 4. If you want to see/use them in things like Funnel exploration, Free Form, see their reporting cards in standard reports, etc., you must register custom parameters in the GA interface. In Google Analytics 4, go to Admin > Custom Definitions. Since we sent 2 custom parameters with the menu link click, we must register them both here. <img class=\"alignnone wp-image-20498 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-4.jpg\" sizes=\"(max-width: 513px) 100vw, 513px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-4.jpg 616w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-4-267x300.jpg 267w\" alt=\"\" width=\"513\" height=\"577\" /> Click the Create Custom Dimensions button and then enter: The name of the parameter. You can enter whatever you want. This is just how the dimension will be displayed in your reports. You can name it “menu_item_url”, “Menu item URL”, or anything else. Since we want to apply this parameter only to one event (and not to all events of the same user), we need to select Event Event parameter. This is where you have to enter its name precisely as you entered it in the GTM tag. If your parameter name is menu_item_url, you must enter it here exactly like that. Don’t worry if the autocomplete feature of that field does not show your parameter yet. Just enter it and save the dimension <img class=\"alignnone size-full wp-image-16820 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T141947.839.jpg\" sizes=\"(max-width: 752px) 100vw, 752px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T141947.839.jpg 752w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T141947.839-300x138.jpg 300w\" alt=\"\" width=\"752\" height=\"347\" /> Then register a second parameter (in my case, that was menu_item_name) and save it. By the way, I sometimes use the words “custom parameter” and “custom dimension” interchangeably. In general, custom metrics and custom dimensions are both grouped as custom parameters. And now we wait. Within the next 24 hours, the custom parameters will start appearing in your Google Analytics 4 reports. Bonus: Sometimes, you want/need to create/edit events directly from the Google Analytics 4 interface. Well, now you can. Introducing Create Event and Modify Event. You can learn more about them by clicking their respective links. #2.3. Test your events in GA4 Once you configure your events, it’s time to test them. The primary feature built for debugging GA 4 data is the DebugView section. You can find it by going to Admin > DebugView on the left side of the GA4 interface. Click it. <img class=\"alignnone wp-image-20496 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3.jpg\" sizes=\"(max-width: 489px) 100vw, 489px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3.jpg 592w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3-300x213.jpg 300w\" alt=\"\" width=\"489\" height=\"348\" /> When you start seeing data in the DebugView, things might look like this: <img class=\"size-full wp-image-17171 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/debugview-data.jpg\" alt=\"\" width=\"840\" height=\"678\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/08/debugview-data.jpg 840w, https://www.analyticsmania.com/wp-content/uploads/2021/08/debugview-data-300x242.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/08/debugview-data-768x620.jpg 768w\" sizes=\"(max-width: 840px) 100vw, 840px\" /> Events are marked with blue icons and conversions with green. Please ignore the fact that I treat menu_click events as conversions. This is just for demonstration purposes 🙂 If you click the event, you will see the parameters that were sent together with an event. Click on the parameter to see its value. <img class=\"size-full wp-image-14775 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T113800.290.jpg\" sizes=\"(max-width: 831px) 100vw, 831px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T113800.290.jpg 831w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T113800.290-300x247.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T113800.290-768x632.jpg 768w\" alt=\"\" width=\"831\" height=\"684\" /> Once you made sure that the data is coming in and is displayed properly, you should submit your GA4 changes in the GTM container and publish it. You can do that by clicking the SUBMIT button in the top right corner and then completing all the other steps that the user interface asks you to do. <img class=\"alignnone size-full wp-image-8253 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2019/05/submit.jpg\" alt=\"\" width=\"283\" height=\"134\" /> After that, you should soon start seeing the new data coming in your real-time reports as well. Please refer to Chapter #1.6. of this blog post to learn more about Realtime reports. #2.4. Where can I find event data in GA4 reports? Here are some of the reports where you can find your data: Admin > Events (this will show just the list of events with counts. Nothing fancy.) Reports > Engagement > Events Explore (a.k.a. Exploration reports) But that is not all. Since GA4 is an event-based analytics platform, every report is affected by events that you send (in one way or another). The aforementioned reports are just the most notable examples. “Reports → Engagement → Events” report Here you will see a list of all events tracked by your Google Analytics 4 property. Click on any event to see a bit more detailed view/reports of that particular event. This is an overview of all events sent to your property + a couple of charts. Below them, you will see a list of events, and if you click on any of them, you will look closely at that event’s data. <img class=\"alignnone size-full wp-image-16822\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T142800.688.jpg\" sizes=\"(max-width: 1125px) 100vw, 1125px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T142800.688.jpg 1125w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T142800.688-300x150.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T142800.688-768x384.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T142800.688-1024x512.jpg 1024w\" alt=\"\" width=\"1125\" height=\"562\" /> Explore (a.k.a. Exploration reports) This is the place where you will be able to drill down into your data. In the Explorations, you can use reports such as Free Form, Funnel Exploration, Path Exploration, etc. Here is an example of a Free Form report. Remember that you will need to wait up to 24 hours for the data to come into your reports. So if you don’t see the data now, be patient. Let’s say that I want to see how people with different device categories interact with the menu bar of my site. Remember, I set up the menu_click event? So, let’s go to Explore and click on the Free Form block. <img class=\"alignnone wp-image-16823 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T143036.466.jpg\" sizes=\"(max-width: 474px) 100vw, 474px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T143036.466.jpg 593w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-06T143036.466-300x224.jpg 300w\" alt=\"\" width=\"474\" height=\"353\" /> Then in the Variables column, I need to include the menu_item_url custom dimension because I want to see how many clicks did each menu URL got. Click the Plus icon… <img class=\"alignnone wp-image-14834 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T163552.828.jpg\" sizes=\"(max-width: 350px) 100vw, 350px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T163552.828.jpg 462w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T163552.828-226x300.jpg 226w\" alt=\"\" width=\"350\" height=\"464\" /> …and then find the menu_item_url dimension. Select it and it will be included in the list of possible dimensions in the report. <img class=\" wp-image-14835 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T163934.457.jpg\" sizes=\"(max-width: 408px) 100vw, 408px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T163934.457.jpg 516w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T163934.457-275x300.jpg 275w\" alt=\"\" width=\"408\" height=\"444\" /> If you CANNOT see the menu_item_url (or whatever custom parameter are you looking for), you have to register them as custom dimensions in GA4 first in Configure > Custom Definitions. And then wait for 24 hours until the data appears in the reports. If the reports don’t work properly, wait for even longer. Then let’s edit the Tab settings. Remove the existing dimensions in the ROWS and include the custom definition that you want to include. In my case, that’s menu_item_url. In the COLUMNS section, I used the Device category dimension. In the VALUES section, select the metric that you wish to see. I used the Event Count. <img class=\"alignnone wp-image-14836 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164022.642.jpg\" sizes=\"(max-width: 469px) 100vw, 469px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164022.642.jpg 554w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164022.642-272x300.jpg 272w\" alt=\"\" width=\"469\" height=\"517\" /> Then you will need to filter only to those events that actually contained the menu_item_url dimension. In my case, that is just a menu_click event. That’s why at the bottom of the Tab Settings section, you should enter a filter: Event name exactly matches menu_click. <img class=\"alignnone wp-image-14837 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164102.867.jpg\" sizes=\"(max-width: 426px) 100vw, 426px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164102.867.jpg 542w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164102.867-300x293.jpg 300w\" alt=\"\" width=\"426\" height=\"417\" /> That’s it, your report will now display how different device categories are clicking menu items; which ones are the most popular, and how many times they were clicked. <img class=\"alignnone size-full wp-image-14838 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164205.953.jpg\" sizes=\"(max-width: 879px) 100vw, 879px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164205.953.jpg 879w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164205.953-300x215.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164205.953-768x551.jpg 768w\" alt=\"\" width=\"879\" height=\"631\" /> Also, don’t forget to change the date range if you need it. You can do that in the top-left corner of the Exploration interface. <img class=\" wp-image-14839 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164244.339.jpg\" sizes=\"(max-width: 266px) 100vw, 266px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164244.339.jpg 369w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T164244.339-300x248.jpg 300w\" alt=\"\" width=\"266\" height=\"220\" /> You can also use event data in things like funnel reports, but let’s keep it for another tutorial (hopefully) in the future. #2.5. How to plan your events in GA4 Note: This chapter will be just an overview of how you should do it. Speaking of actual planning, I would say that a spreadsheet is your best friend. Write down all the events that you want to track, and then: Check whether they fall under the categories: automatically collected, enhanced measurement, or recommended. If yes, check their naming convention of event names and parameters (dimensions). If not, then come up with your own values. Just keep in mind that there are some limitations related to the length. Here is an example of a spreadsheet with events that you could prepare yourself and then try to pick the right naming convention. You can use it as an example/inspiration to create your own spreadsheet. Let’s take a quick overview of the spreadsheet. There are two sheets: The first one is for the list of events and what kind of parameters do you want to track together with them The second one is a list of parameters with their explanations The first sheet: In column B, you can just briefly describe an event in plain English In column A, you should enter the event name that you will use in Google Analytics 4. You should pick this name based on the previously described process: check the automatically tracked events, enhanced measurement, and recommended events. If none of the events match yours, then add a custom name. It looks pretty clean to use this principle to name the event, e.g. event_name (all lowercase and connected with an underscore). Event names like “Submitted the Form” will also work, but the all-lower-case-with-underscore looks cleaner (I believe that the term snake-case applies here). Column C is for type (is it Automatically collected, Enhanced Measurement, Recommended or Custom?). Column D is for parameters that you want/plan to track with particular events. I did not include default parameters that are automatically tracked with every event: language, page_location, page_referrer, page_title, screen_resolution. <img class=\"alignnone size-full wp-image-14840\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/sheet.jpg\" sizes=\"(max-width: 951px) 100vw, 951px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/sheet.jpg 951w, https://www.analyticsmania.com/wp-content/uploads/2020/11/sheet-300x98.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/sheet-768x251.jpg 768w\" alt=\"\" width=\"951\" height=\"311\" /> If you are dealing with mobile apps as well, you could include an additional column, “Platform,” where you could enter “web” or “Android / iOS”. The second sheet: Column A is for the parameter name Column B is for a platform. If you are working just with the website, feel free to remove that column. Column C is the type (is it Built-in, Recommended, or Custom). Built-in means that it is used by automatically tracked events or Enhanced Measurement. Recommended parameters are for recommended events. Custom parameters are your own unique events. Column D is for description (in plain English). <img class=\"alignnone size-full wp-image-14841\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T165856.326.jpg\" sizes=\"(max-width: 1064px) 100vw, 1064px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T165856.326.jpg 1064w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T165856.326-300x104.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T165856.326-768x266.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T165856.326-1024x355.jpg 1024w\" alt=\"\" width=\"1064\" height=\"369\" /> IMPORTANT: This spreadsheet is just an example. You don’t have to follow it blindly. If you wish, you can take just some parts and adapt it to your needs. Once you prepare the plan, then you can track events with Google Analytics 4. Don’t rush too soon. Otherwise, you might face the consequences in the long run. #2.6. Event limits in Google Analytics 4 Another thing to keep in mind is that there are some limits (and some are gone (at least for now?). I would always recommend for you to refer to this page when it comes to limits. Anyway, here are some of the things you should remember now: There is no limit for events in total (at least right now). In Universal Analytics (free account), the allowed limit of hit per property was 10 million. Currently, there is no such limit in Google Analytics 4. But you never know what might happen in the future 🙂 You can have up to 50 custom dimensions and 50 custom metrics registered in a property. The keyword here is registered. This means you have to go to Admin > Custom definitions and have them configured there. If you send more custom parameters, but they are not registered, you’re fine. You can send up to 25 parameters with an event There are some length limits for event names and parameters as well. Both (the event name and the parameter name) must be up to 40-characters-long. To learn more about the limits, as always, refer to this page. Chapter III: Track Conversions with Google Analytics 4 Not all events are equal. Some are more important to a business. Enter Conversions. #3.1. What is a conversion in general? I realize that some of my readers who read this blog post might be completely new to web analytics and conversions. If you are one of them, here’s a quick introduction. And if you already know what conversions are, feel free to skip to the next chapter of this blog post. A conversion is an important interaction you want your visitors/users to complete. Conversions can be split into micro and macro conversions. An example of a micro-conversion can be a newsletter subscription, a download of a whitepaper, etc. Micro conversions are usually described as conversions that put your visitors/users one step closer to the main (macro) conversion. Macro-conversions are the most important interactions, such as a purchase. By tracking conversions, you can better understand what is working for your business and what isn’t. For example, you can create a segment of your users who have made a purchase and then try to understand what they are doing, what their behavior is, etc. Also, conversions are used to measure the effectiveness of advertising campaigns and then redistribute your advertising budget. Hopefully, this super-brief introduction gave you a better understanding of this concept. Now, let’s learn how to track conversions with Google Analytics 4. #3.2. Goodbye, goals. Hello, conversions! Those who have worked with the previous versions of Google Analytics, for example, Universal Analytics, are familiar with the term “Google Analytics Goal”. Basically, that’s how GA was calling conversions in the past. If you want to treat a page view of the order confirmation page as a conversion, you could create a destination goal. Speaking of other types of Google Analytics goals, you could create goals that: Were based on events and their parameters Or that were based on the duration of the session (if a visitor spends more than X minutes on your website) Or that were based on the number of page/screen views per session <img class=\" wp-image-14896 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/google-analytics-goals.jpg\" sizes=\"(max-width: 415px) 100vw, 415px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/google-analytics-goals.jpg 534w, https://www.analyticsmania.com/wp-content/uploads/2020/11/google-analytics-goals-300x262.jpg 300w\" alt=\"\" width=\"415\" height=\"363\" /> Also, it’s worth mentioning that you could create up to 20 goals per GA view. In GA 4, that limit is 30 conversions per property. Well, with the rise of GA4, the concept of Google Analytics goals is gone. Now, the most important interactions are called conversions (this term has been adopted by the industry and other marketing/analytics tools for many years, and even GA users were often referring to goals as “conversions”). It’s a welcome cosmetic change that’s been long overdue. However, the name is not the only thing that has changed. Many things are now different in Google Analytics 4 when it comes to conversions: The way we have to configure them is different The types of conversions are different (no more out-of-the-box destination, session duration, or number-of-pageviews goals) It’s all about the event now. It’s your job to send them and mark the most important ones as conversions. Speaking of ways how to configure conversions in Google Analytics 4, there are two options (that you can control) and one that’s predefined. Let’s start with the latter. #3.3. Predefined Conversions There is a bunch of predefined conversions that you cannot disable: first_open (applies to mobile applications) app_store_subscription_convert (applies to mobile applications) app_store_subscription_renew (applies to mobile applications) in_app_purchase (applies to mobile applications) purchase (applies to websites and mobile applications) Speaking of purchase, here is a guide by Simo Ahava that explains the entire implementation process in great detail. If you go to your Google Analytics 4 property and then Admin (on the left sidebar) > Conversions, you will see the list of those predefined conversions (they will be displayed here if you have received at least one event of that particular name). If you have only the Web data stream connected to the property, your only default conversion will be purchase (and that cannot be disabled). <img class=\"wp-image-16861 size-full aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-09T154756.621-e1670513624521.jpg\" alt=\"\" width=\"627\" height=\"290\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-09T154756.621-e1670513624521.jpg 627w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-09T154756.621-e1670513624521-300x139.jpg 300w\" sizes=\"(max-width: 627px) 100vw, 627px\" /> If you have connected any of the app data streams, then you’ll most likely see the rest of the aforementioned conversions too. But since there isn’t much, we can configure, that’s all I can say in this chapter. Now, let’s move to the next group of conversions. #3.4. Conversions that can be switched on Now, if you want to mark an event as a conversion, you just have to go to the list of Admin > Events (on the left sidebar) and then switch the toggle next to the event that’s important for your business. So, for example, if you have an event called ebook_downloaded, then you can flip the switch and turn it into a conversion (note: this will apply only to the new data. The events that were collected in the past will not be turned into conversions retroactively). <img class=\"wp-image-16862 size-full aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-09T154859.208-e1670487730329.jpg\" sizes=\"(max-width: 633px) 100vw, 633px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-09T154859.208-e1670487730329.jpg 633w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2021-08-09T154859.208-e1670487730329-300x102.jpg 300w\" alt=\"\" width=\"633\" height=\"215\" /> Alternatively, you can go to Configure > Conversions (on the left sidebar), then press New conversion event and enter the event’s name, for example, ebook_downloaded. There is no difference between entering the name of the event manually and flipping the toggle button in the Configure > Events list. If you decide to flip the switch, you will need to wait until that event appears in the list. Once you do that, wait for up to 24 hours, and you will start seeing conversion data in the list of all Conversions. If you want to find out about other places where the conversion data is available in the Google Analytics 4 interface, jump to chapter #3.8. of this blog post. #3.5. Create events and mark them as conversions I bet that some of my readers have one question now. What if you don’t want to mark ALL events (of a certain event name) as conversions? Example: you have a “Thank you” page to which users are redirected when they subscribe to a newsletter. Let’s say that the URL is https://www.mywebsite.com/thank-you/. If I mark the page_view event as a conversion, ANY pageview will become a conversion. How can I separate only those pageviews that happened on the /thank-you/ page? You can either send a dedicated event (with a different name) from Google Tag Manager/Gtag.js, or you can use the Create Event feature in the GA4 interface. This feature allows you to create a new event based on other incoming events. On the Configure > Events page, click Create Event and then click Create. <img class=\"size-full wp-image-20513 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-11.jpg\" sizes=\"(max-width: 891px) 100vw, 891px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-11.jpg 891w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-11-300x178.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-11-768x455.jpg 768w\" alt=\"\" width=\"891\" height=\"528\" /> Then you will need to enter the name of the custom event. Once again, you can name it whatever you want. Just make sure that the name communicates what it means. thankyou_page_visit might be a good option. Then let’s move on to the Matching Conditions section. Here we must tell GA4 what kind of event we are looking for. When that particular event will be spotted, then our thankyou_page_visit should be created as well. In my case, I need to enter the following conditions: event_name equals page_view page_location contains /thank-you/ <img class=\"size-full wp-image-14816 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160854.051.jpg\" sizes=\"(max-width: 850px) 100vw, 850px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160854.051.jpg 850w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160854.051-300x213.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T160854.051-768x546.jpg 768w\" alt=\"\" width=\"850\" height=\"604\" /> If you want to copy all the parameters from the page_view event to the new event, keep the checkbox Copy parameters from the source event enabled. If some of the parameter’s name is incorrect and you want to fix it as well, you can Add Modification in the Parameter Configuration section. For example, if an event contains the parameter pricingPlan but you want it to be pricing_plan, you can introduce a new field (and reuse its value) while removing the incorrect parameter (by leaving the New Value empty). <img class=\"size-full wp-image-14818 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/create-event-in-google-analytics-4-pricing-plan-1.jpg\" sizes=\"(max-width: 858px) 100vw, 858px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/create-event-in-google-analytics-4-pricing-plan-1.jpg 858w, https://www.analyticsmania.com/wp-content/uploads/2020/11/create-event-in-google-analytics-4-pricing-plan-1-300x232.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/create-event-in-google-analytics-4-pricing-plan-1-768x594.jpg 768w\" alt=\"\" width=\"858\" height=\"664\" /> Take a closer look at [[pricingPlan]] in the screenshot above. Double square brackets mean that GA4 will reuse the value of the parameter pricingPlan in that event. Once you save the changes, you can view them in the Real-time reports and the DebugView of GA4. Also, when you create that new event in GA4 (and you want that to become a conversion), don’t forget to mark that event as a conversion in the Configure > Events page. <img class=\"alignnone size-full wp-image-16836 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/05/image-2021-08-09T134614.008.jpg\" sizes=\"(max-width: 711px) 100vw, 711px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/05/image-2021-08-09T134614.008.jpg 711w, https://www.analyticsmania.com/wp-content/uploads/2021/05/image-2021-08-09T134614.008-300x97.jpg 300w\" alt=\"\" width=\"711\" height=\"230\" /> If you don’t like to wait for up to 24 hours (because that thankyou_page_visit will not appear in the list of all your events immediately), you can create a new conversion immediately. Click the Configure section on the left sidebar of your GA4 interface. Then go to Conversions. Then click New conversion event and enter the name of the event that you have just created. Click Save. <img class=\"alignnone size-full wp-image-20504\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-8.jpg\" sizes=\"(max-width: 1031px) 100vw, 1031px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-8.jpg 1031w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-8-300x186.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-8-768x475.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-8-1024x634.jpg 1024w\" alt=\"\" width=\"1031\" height=\"638\" /> That way, you will mark the newly created thankyou_page_visit event as a conversion (without the need to wait for 24 hours until it appears on the Admin > Events page. #3.6. Or try planning a better event naming convention I’m just continuing the previous chapter of this blog post here. If we are talking about events that you are sending from the website’s code or Google Tag Manager to GA4, you could just plan your event naming convention better and create more distinct events. Imagine that you track various form submissions with the event name form_submission, but you want to treat only certain types of forms as conversions. Let’s say that you track contact form submissions, search form submissions, and registration form submission events, but you only want to treat the registration form submission as a conversion. In that case, you could track 3 separate events: contact_form_submission search_form_submission sign_up And then mark only the sign_up event as a conversion. This, of course, requires more thorough planning upfront but every solid setup starts with one. #3.7. Check the data in Google Analytics DebugView Once you configure your conversions, it’s time to test them. The primary feature built for debugging GA 4 data is the DebugView section. You can find it at the bottom left corner of your GA4 interface. Click it. If you need a refresher on how DebugView works, feel free to revisit chapter #1.4 of this blog post. <img class=\"alignnone wp-image-20496 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3.jpg\" sizes=\"(max-width: 489px) 100vw, 489px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3.jpg 592w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3-300x213.jpg 300w\" alt=\"\" width=\"489\" height=\"348\" /> Events are marked with blue icons, and conversions with green. If you click the event, you will see the parameters that were sent together with an event. Click on the parameter to see its value. <img class=\"size-full wp-image-14775 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T113800.290.jpg\" sizes=\"(max-width: 831px) 100vw, 831px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T113800.290.jpg 831w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T113800.290-300x247.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T113800.290-768x632.jpg 768w\" alt=\"\" width=\"831\" height=\"684\" /> Once you made sure that the data is coming in and is displayed properly, you should submit your GA4 changes in the GTM container and publish it. #3.8. Where can I see the conversion data in GA4 reports? Admin > Conversions section in the left sidebar menu. This place is like an overview of all events that you have marked as conversions. Acquisition > Traffic Acquisition, and then there is a column Conversions in the table If you have implemented Ecommerce tracking, the data will appear in the Monetization reports Explore. For example, you can include the metric Conversions in the Exploration report. <img class=\"wp-image-16863 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/conversions-in-google-analytics-4-explorations.jpg\" sizes=\"(max-width: 548px) 100vw, 548px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/conversions-in-google-analytics-4-explorations.jpg 603w, https://www.analyticsmania.com/wp-content/uploads/2020/11/conversions-in-google-analytics-4-explorations-300x269.jpg 300w\" alt=\"\" width=\"548\" height=\"491\" /> Chapter IV: Reports in Google Analytics 4 I did not want to make this blog post 20 000 words long, thus I will share links to several other tutorials of mine, and you can crunch them later. Even though I have already mentioned several places where you can find your event data in Google Analytics 4, I have more resources (videos, blog posts) that you might find helpful. So if you want to get started with Google Analytics 4 reports, look no further: How to track and report site search with GA4 Free form reports in GA4 (previously Explorations) How to track and report scroll events in GA4 How to report outbound link clicks in GA4 Funnel exploration reports Path exploration reports Google Analytics 4 Tutorial for Beginners: Final Words Google Analytics 4 is a completely different tool (if we compare it to the previous versions of Google Analytics). And this blog post proves that there’s a steep learning curve ahead. We were just scratching the surface of GA4 capabilities, and the blog post is already 8000+ words long. If you want to learn more about the platform, keep an eye on analyticsmania.com and my YouTube channel. Also, if you want to be able to track various interactions and send them to Google Analytics (or any other marketing/analytics tool that you are using), Google Tag Manager is the best option. But there’s a steep learning curve as well (unless I show you a shorter and more efficient way). That shorter and more efficient way is my Google Tag Manager Masterclass for Beginners. You can learn more about it here. Not ready to commit to a course? Then take a look at my free ebook below. It’s much more basic but still gives enough info to get started. <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2019/07/Google-tag-manager-for-beginners-ebook.jpg\" alt=\"Subscribe and Get the Ebook - Real Book Img - GTM for Beginners\" />","metadata":{"source":"https://www.analyticsmania.com/post/google-analytics-4-tutorial-for-beginners/","title":"Google Analytics 4 Tutorial for Beginners","date":"2023-04-06T01:19:21+00:00","contentLength":14109}},{"pageContent":"Updated: March 1st, 2023. Google Tag Manager is a very handy tool that helps you manage marketing tags (a.k.a. tracking codes) in one place and deploy them (usually) without the developer’s help. If you consider yourself a beginner, you’re probably wondering where to start? What’s the best way to learn Google Tag Manager? If you’re an intermediate or advanced user, you’re probably looking for new ways to improve your GTM knowledge? In this blog post, I’ve collected a bunch of options on how you can learn Google Tag Manager as fast as possible. Decide what your priorities are Before you jump into the world of Google Tag Manager, first think about your priorities. Mainly, I am talking about your time. Also, what level of GTM knowledge is enough for you? #1. You want to learn fast and in-depth If you are strict on time and you need to learn Google Tag Manager in-depth as soon as possible, then I would say an online course is your best option. Online courses provide a clear step-by-step process on how to learn a particular topic. If a course offers support (like I do in my courses), it’s even better. If you get stuck, you will be able to ask the instructor. #2. You want to learn fast, but the basics are enough If you have very limited time but it’s enough for you to learn just the basics, then free options will be more than enough for you: Ebooks (I will mention some of them later in this article) Video tutorials (like this one (LINK), which is available on my Youtube channel) Tutorials for beginners (for example, this one). They will give you proper fundamentals and will show you the basics needs for the simple setups (e.g., how to install Google Analytics 4 with Google Tag Manager). But if you want to self-learn this topic and for free, then the word “fast” cannot be included in the equation. Imagine that you have a triangle, but you can choose only two options out of three. <img class=\"alignnone size-full wp-image-21344\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/01/image-2023-03-24T140139.543.jpg\" alt=\"\" width=\"1362\" height=\"955\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/01/image-2023-03-24T140139.543.jpg 1362w, https://www.analyticsmania.com/wp-content/uploads/2022/01/image-2023-03-24T140139.543-300x210.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/01/image-2023-03-24T140139.543-768x539.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2022/01/image-2023-03-24T140139.543-1024x718.jpg 1024w\" sizes=\"(max-width: 1362px) 100vw, 1362px\" /> #3. Learn in-depth and for free I am NOT saying that this is not possible. Of course, it’s possible to learn by yourself and for free. You will need to read a lot of blog posts, constantly check the documentation (which is often confusing and sometimes not in-depth enough), maybe watch videos, etc. But the key thing here is that you lose the word “fast” in your learning process. There will be no “fast”. You will spend many hours on finding the right resources and learning by trial and error. If you are find with that, then sure, go ahead and chose this option. In that case, you will find useful the following learning methods: E-books Books Free online courses (but they will be much more limited than the paid ones) GTM documentation Youtube More details on each learning method So, once you have decided on your priorities (of how you are willing to learn Google Tag Manager), now you can take a look at at each learning method individually (where I will provide the links too). #1. E-books If you’re a fan of reading e-books and taking them whenever you want (even where there is no internet connectivity), you might like this option. I have published several Google Tag Manager e-books. One of them is for beginners, the other one is for more experienced users. Click the images below to download them. <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2019/07/Google-tag-manager-for-beginners-ebook.jpg\" alt=\"Subscribe and Get the Ebook - Real Book Img - GTM for Beginners\" /> <img class=\"alignnone size-full wp-image-11221\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2021/04/700px-Subscribe-and-Get-the-Ebook-8-steps-to-become-an-experienced-gtm-user.jpg\" alt=\"\" width=\"932\" height=\"360\" /> #2. Free Online Courses Free online courses will give you a good basic perception of what Google Tag Manager is and what its main components are. If you’re just starting (or just considering to learn), these online courses are fairly good options. <img class=\"alignnone size-full wp-image-6971\" src=\"https://www.analyticsmania.com/wp-content/uploads/2019/01/Enroll-in-GTM-Fundamentals-in-content-banner-resized.jpg\" alt=\"\" width=\"989\" height=\"403\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2019/01/Enroll-in-GTM-Fundamentals-in-content-banner-resized.jpg 989w, https://www.analyticsmania.com/wp-content/uploads/2019/01/Enroll-in-GTM-Fundamentals-in-content-banner-resized-300x122.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2019/01/Enroll-in-GTM-Fundamentals-in-content-banner-resized-768x313.jpg 768w\" sizes=\"(max-width: 989px) 100vw, 989px\" /> Level of difficulty: Beginner, Entry level Price: Free Back in 2015, Google launched its own GTM Fundamentals course, however, it’s out of date now (because the interface displayed there is still from 2015. That’s where I chimed in and created a free Google Tag Manager Fundamentals course for the latest version of GTM. In this course, you’ll learn the basics of Google Tag Manager, how to properly install it, how to set tags, triggers, variables, how to test and publish your changes. Also, you’ll get some tips on what topics should you learn next. Here’s what’s inside the course: 75 minutes of video material A 30-question quiz at the end of the course Every lesson is enriched with related useful resources If some questions arise during the course, you’ll find the link to our Facebook community under each video lesson. Enroll in course #3. Youtube Just as there are many blog posts about GTM, you can also find many video tutorials on Youtube. For example, Analytics Mania also runs a YT channel where you can find useful tutorials. Here is one of the videos on that channel. So, if you want to stay up-to-date and learn more about GTM, consider subscribing. #4. Premium Online Courses Another alternative to how to learn Google Tag Manager is paid online courses. Unlike free courses (that just scratch the surface), paid ones will give you a more personal and premium experience, will go deeper into the topic, and will help you go further with your skillset. Also, in that course, you will get support from the instructor. Google Tag Manager course by Analytics Mania <img class=\"alignnone size-full wp-image-7340\" src=\"https://www.analyticsmania.com/wp-content/uploads/2019/01/Enroll-in-GTM-for-Beginners-in-content-banner.jpg\" alt=\"\" width=\"989\" height=\"432\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2019/01/Enroll-in-GTM-for-Beginners-in-content-banner.jpg 989w, https://www.analyticsmania.com/wp-content/uploads/2019/01/Enroll-in-GTM-for-Beginners-in-content-banner-300x131.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2019/01/Enroll-in-GTM-for-Beginners-in-content-banner-768x335.jpg 768w\" sizes=\"(max-width: 989px) 100vw, 989px\" /> Level of difficulty: Beginner-Intermediate This course is a complete package for beginners. While the free GTM Fundamentals course explains the very essential topics, GTM For Beginners dives way deeper, explains how to track various interactions, how to track sales/conversions not only with Google Analytics 4 but also with Facebook Pixel. Additionally, this course will explain how to comply with your tag management with GDPR, and, of course, how to apply GTM in real-life projects. Here’s what’s inside the course: Quick quizzes after each module Many practical tasks and a sandbox Private Facebook group for students Downloadable resources, checklists, templates The final task is reviewed by the instructor + personal feedback Lifetime access to the course material If the course gets an update, it’s free for existing students Of course, you can learn Google Tag Manager by yourself. But it will take you months (many months to achieve that). With this course, you’ll save a lot of time and reach your destination faster. Learn more about this course Intermediate Google Tag Manager course (+ Advanced Topics) <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2021/05/Enroll-in-Intermediate-GTM-course-in-content-banner.jpg\" alt=\"Enroll in Intermediate Google Tag Manager course\" /> Level of difficulty: Intermediate-Advanced This course is your next level (compared to the Beginners course). After taking it, you will unlock the true potential of Google Tag Manager and will be more confident in your tracking setup. You will learn how Data Layer works under the hood, you will understand how to utilize very useful (but not that popular) variables. Additionally, I will teach you how to implement the GA4 e-commerce tracking, server-side tagging, and so much more! Here’s what’s inside the course: Quick quizzes after each module Many practical tasks and a sandbox Private Facebook group for students Downloadable resources, checklists, templates The final task is reviewed by the instructor + personal feedback Lifetime access to the course material If the course gets an update, it’s free for existing students #5. Paid Offline Courses Live training sessions (a.k.a. paid offline courses) give you the most personal and premium experience. Participants work in a live Google Tag Manager account, do various exercises, take short quizzes (usually), and actively participate throughout the training sessions to reinforce the lessons. This makes the entire learning process much faster. Once you bump into some obstacles, the instructor notices that and gives a helping hand by providing necessary answers/tips. Usually paid offline courses take from 1 to 3 days. Since I am running such sessions myself, the optimal duration is 2 days (IMHO), because: It’s nearly impossible to cover all important GTM topics in one day. Well, technically speaking, it’s possible, but the amount of new information is overwhelming. People need some time to digest what they learn and one day is not enough. On the second day, I always like to recap what we’ve already learned. 3-day-sessions might be too exhausting to some participants (+ they usually have their day jobs, so taking 3 days off their regular work schedule might be too “expensive”). Few offline courses to mention <img class=\"alignnone wp-image-2502 size-full\" src=\"https://www.analyticsmania.com/wp-content/uploads/2017/07/Google-Tag-Manager-Workshop.png\" alt=\"Google Tag Manager Workshop\" width=\"1093\" height=\"489\" /> Level of difficulty: Beginner-intermediate. Price: Various. Bounteous – Google Tag Manager Workshop (United States) Jellyfish – Google Tag Manager Training (United Kingdom) Data Runs Deep – Google Tag Manager for Marketers and Developers (Australia), etc. Don’t worry if your country is not on the list above. There are many other Google Tag Manager training sessions, google it. Chances are there’s at least one in your country. Otherwise, choose any other alternative mentioned in this blog post. #6. Books Google Tag Manager for Beginners <img class=\"alignnone size-full wp-image-7805\" src=\"https://www.analyticsmania.com/wp-content/uploads/2019/01/tag-manager-italia-book.jpg\" alt=\"\" width=\"1093\" height=\"489\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2019/01/tag-manager-italia-book.jpg 1093w, https://www.analyticsmania.com/wp-content/uploads/2019/01/tag-manager-italia-book-300x134.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2019/01/tag-manager-italia-book-768x344.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2019/01/tag-manager-italia-book-1024x458.jpg 1024w\" sizes=\"(max-width: 1093px) 100vw, 1093px\" /> Level of difficulty: From Beginner to Intermediate This book is for those who are starting with Google Tag Manager and want to understand the logic behind it, what are tags, triggers, variables, data layer, and so much more. Even though the book’s title includes the word “beginners”, there are also some intermediate (and a pinch of advanced) topics that you will find useful. Fun fact. I had a chance to get into the creative process of this book and suggested some improvements that were later implemented by Matteo. So you could say that this book is 0.01% mine 🙂 Jokes aside, Google Tag Manager for Beginners book is a good trophy that should be in a bookshelf of every aspiring GTM user. Practical Google Analytics and Google Tag Manager For Developers <img class=\"alignnone wp-image-2503 size-full\" src=\"https://www.analyticsmania.com/wp-content/uploads/2017/07/Practical-Google-Analytics-and-Google-Tag-Manager-for-Developers.png\" alt=\"Practical Google Analytics and Google Tag Manager for Developers\" width=\"1093\" height=\"489\" /> Level of difficulty: From Beginner to Advanced If you’re more of a book person, I highly recommend Practical Google Analytics and Google Tag Manager for Developers. Don’t be intimidated by its title. Although it covers various technical topics, you’ll understand them even if you’re not a developer. It starts from basic concepts and then gradually increases the level of difficulty. It explains a concept and then takes you step-by-step on how to implement that concept. You should do the exercises if you want to get anything out of this book. This book consists of 50% Google Tag Manager and 50% Google Analytics tutorials. I have it on my shelf, you should too. Even though the book is fairly old, many concepts explained there can still be applied today. #7. Comprehensive Guides/Resources <img class=\"alignnone wp-image-587 size-full\" src=\"https://www.analyticsmania.com/wp-content/uploads/2017/02/Tall-Hero-image-Guided-120-GTM-resources-e1487433714918.png\" alt=\"120 Google Tag Manager Resources\" width=\"1039\" height=\"387\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2017/02/Tall-Hero-image-Guided-120-GTM-resources-e1487433714918.png 1039w, https://www.analyticsmania.com/wp-content/uploads/2017/02/Tall-Hero-image-Guided-120-GTM-resources-e1487433714918-300x112.png 300w, https://www.analyticsmania.com/wp-content/uploads/2017/02/Tall-Hero-image-Guided-120-GTM-resources-e1487433714918-768x286.png 768w, https://www.analyticsmania.com/wp-content/uploads/2017/02/Tall-Hero-image-Guided-120-GTM-resources-e1487433714918-1024x381.png 1024w\" sizes=\"(max-width: 1039px) 100vw, 1039px\" /> Level of difficulty: From Beginner to Advanced Let’s go back to free Google Tag Manager resources. After you’ve completed Google Analytics Fundamentals free online course (which I always recommend as the first step of this GTM-learning journey), go ahead and try these guides/resources: The Ultimate List of 90+ Google Tag Manager Resources, which are split into categories. If you’re thriving for even more resources, download the list of 120+ GTM Resources (Analytics Mania subscribers can download the list from every newsletter I send). E-book: Google Tag Manager for Beginners. A proper introduction to GTM beginners. The Library of Google Tag Manager Recipes. An ever-growing list of ready-made GTM container templates with the most common solutions. Download them, import to Google Tag Manager and you’re good to go! Expand your web analytics with ease! Also, you might be interested in this e-book: 8 steps to become an experienced Google Tag Manager user. Built for intermediate GTM users who want to reach the next level. Click the banner below and download it free. <img class=\"alignnone size-full wp-image-11221\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2021/04/700px-Subscribe-and-Get-the-Ebook-8-steps-to-become-an-experienced-gtm-user.jpg\" alt=\"\" width=\"932\" height=\"360\" /> #8. Practice practice practice <img class=\"alignnone wp-image-2504 size-full\" src=\"https://www.analyticsmania.com/wp-content/uploads/2017/07/Practice.png\" alt=\"Practice\" width=\"1093\" height=\"489\" /> All these courses and resources would be useless without practice, so make sure to always keep GTM running in one of your browser tabs. Playing around with my personal projects’ GTM containers + working with personal clients is the main cause of my GTM breakthrough and growing skills. Although there are still a lot of lessons to be learned, I feel that I’ve come a moderately long way. Here are my tips for you to get more practical knowledge: Do you have your own website/blog? Start tracking it with GTM. Do you work in an agency? Start implementing GTM in new projects. Real-life situations are what drives knowledge. Are you working with a team? If there’s someone who knows GTM pretty well, learn from them. Ask questions. Challenge yourself. Use Data Layer Inspector, inject your code to other websites (this happens only within boundaries of your browser. No, you’re not hacking anything) and try to track various elements: forms, clicks, page views, etc. Join forums, groups, and communities. If someone asks for help, try solving their problem. Don’t promise anything upfront, because you’ll probably fail at first (due to lack of experience), but eventually, you’ll get better at this. Trial and error is the way to go. Be up-to-date. Follow Others Communities Join these communities if you want to be the first to hear the GTM news, solve your problems, learn Google Tag Manager tricks, and get some new ideas. GTM Community on Facebook (recommended) GTM Subreddit Official Google Tag Manager Forum Blogs/Websites As for blogs, there is a bunch of noteworthy ones which you should subscribe to: Analytics Mania (which you are currently reading) #shamelessplug Simo Ahava’s Blog. And others. Conclusion: How To Learn Google Tag Manager There are multiple ways to master GTM, both free and paid. My recommendation is to start with a free GTM Fundamentals course (created by me). In less than a day you’ll get the basics necessary for further growth. Then, think of how much spare time do you have. Choose paid online or offline courses if time is very precious for you. Otherwise, try learning on your own: follow blogs, watch video tutorials, etc. Learning on your own is definitely possible but will require much more time. But most importantly, keep practicing. You might keep reading all you want, but without actual battlefield experience, the theory is pretty much useless. So what are you waiting for? Go ahead and learn Google Tag Manager! <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2019/07/Google-tag-manager-for-beginners-ebook.jpg\" alt=\"Subscribe and Get the Ebook - Real Book Img - GTM for Beginners\" />","metadata":{"source":"https://www.analyticsmania.com/post/learn-google-tag-manager/","title":"Best Ways to Learn Google Tag Manager","date":"2023-03-01T01:43:54+00:00","contentLength":3248}},{"pageContent":"Here’s a situation. You have implemented event tracking with Google Analytics 4 but cannot see those events in reports. Or maybe you see the events, but some parameters/dimensions are missing? If this sounds familiar, you’ve come to the right place. In this blog post, I will explain why Google Analytics 4 events are not showing up in your reports. So if you are wondering, “why is my Google Analytics not showing any data?”, let’s dive in. Table of Contents – Hide table of contents – #1. Not enough time has passed #2. Data thresholding #3. Incorrect date range #4. Internal/developer filter is active #5. Modify events rule #6. Longer delay in Admin > Events #7. Data is sent to the wrong GA4 property #8. Event parameters are not appearing in reports Other useful resources Final words #1. Not enough time has passed Google Analytics reports (excluding real-time and debugview) are pretty slow to process and display the data. It’s normal to wait 24-48 hours. So if you have sent some events to GA4 reports and waited just for several hours, that is not enough. Check your data tomorrow. If that still does not work, wait one more day. If that does not help, then your GA4 events are not showing up because of some other reason (then check other tips in this blog post). #2. Data thresholding Data thresholding is a very common issue why you might be missing certain events (especially if you work with a smaller website/property). At the top of your GA4 standard or exploration report (where you are looking for events), look for a green checkmark. <img class=\"alignnone wp-image-21058 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-73.jpg\" alt=\"\" width=\"616\" height=\"404\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-73.jpg 701w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-73-300x197.jpg 300w\" sizes=\"(max-width: 616px) 100vw, 616px\" /> If you see it, data thresholding is not applied, and you should skip to the next chapter of this blog post. However, if you see an orange exclamation mark, click it. Does the warning mention thresholding? <img class=\"alignnone wp-image-20906 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-22.jpg\" sizes=\"(max-width: 301px) 100vw, 301px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-22.jpg 356w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-22-300x222.jpg 300w\" alt=\"\" width=\"301\" height=\"223\" /> If yes, then I think we found out why you are missing some events. In general, thresholds in Google Analytics 4 are caused by a feature called Google Signals. It is disabled by default, but if you turn it on, things might get weird. If you are looking at the report and the property contains data from Google Signals, Google Analytics will hide rows in the reports with small numbers. I don’t know the exact number, but it looks like something below 50 users/events per row. So if you have tracked a small number of events, thresholding kicked in and hid the event(s) from the reports. Don’t worry. The data is not lost (however, it is hidden). One workaround will help you turn off thresholding – changing the default reporting identity. But there’s a caveat, too (learn more here). You can change it by going to Admin > Reporting Identity. Here you will see two options (but actually, there are three). Click Show all. <img class=\" wp-image-20897 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-21.jpg\" sizes=\"(max-width: 795px) 100vw, 795px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-21.jpg 964w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-21-300x170.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-21-768x435.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-21-440x250.jpg 440w\" alt=\"\" width=\"795\" height=\"450\" /> Then select the Device-based reporting identity. Refresh the page, go back to your events report, and the missing data should be displayed. You can change the reporting identity as often as you want (your data will not be modified). I highly recommend that you read this article to understand better what thresholding is, how it works, and how to deal with it. #3. Incorrect date range We’re all human, and sometimes, we make mistakes. I recommend double-checking that you have selected the correct date range in your reports. Maybe you are looking at the date when the missing event was not tracked yet. You can change the date range on the top-left corner (in Explorations) or in the top-right corner (of the standard GA4 reports). #4. Internal/developer filter is active In Google Analytics 4, you can exclude your internal traffic (that is coming from your employees/co-workers). That feature checks the IP address of the visitor, and if it matches the rules of internal/developer traffic, your events will be excluded. But that might be why you cannot see your events in the reports. The first place to check is to go to Admin > Data settings > Data filters. If you see “Active” next to the Internal and Developer filters, this might be the reason. <img class=\" wp-image-21041 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/11/image-72.jpg\" alt=\"\" width=\"753\" height=\"576\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/11/image-72.jpg 861w, https://www.analyticsmania.com/wp-content/uploads/2022/11/image-72-300x230.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/11/image-72-768x588.jpg 768w\" sizes=\"(max-width: 753px) 100vw, 753px\" /> But we are not done yet. In the Admin panel, go to Data Streams > Click your web stream > Configure Tag Settings > Show All > Define internal traffic. This will open a list of rules that define internal/developer traffic. If you see no rules, your GA4 events are not showing up for another reason (in that case, continue reading this blog post) If you see some rules, click them and see what IP addresses are configured there. If one of them is yours, that might be why you don’t see your events in GA4 reports. #5. “Modify events” rule Google Analytics 4 allows you to modify incoming events straight from the GA4 interface. For example, it can add/edit/remove a particular event parameter. Or it can rename the event. Maybe that’s what’s happening in your case. In Google Analytics 4, go to Admin > Events > Modify Event. <img class=\"alignnone wp-image-20505 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-9.jpg\" sizes=\"(max-width: 1014px) 100vw, 1014px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-9.jpg 1014w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-9-300x186.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-9-768x477.jpg 768w\" alt=\"\" width=\"901\" height=\"560\" /> If you see an empty list, then “Modify event” is not why you are missing a particular event. But if you see some rules, click them individually and see what they are doing. Maybe one of them is looking for a specific event and then renames it? To understand how this feature works, I recommend reading this chapter in another blog post. #6. Longer delay in Admin > Events Occasionally, I face a situation where (for some reason) the list of events in the GA4 admin panel is lagging behind other reports of Google Analytics. I am talking about this list: Admin > Events. <img class=\"alignnone wp-image-21143 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-100.jpg\" alt=\"\" width=\"647\" height=\"609\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-100.jpg 808w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-100-300x282.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-100-768x722.jpg 768w\" sizes=\"(max-width: 647px) 100vw, 647px\" /> Sometimes, it does not show particular events for days (even though other reports, like Reports > Engagement > Events work just fine). So my tip is not to fully rely on the Admin > Events list. Instead, check other places for the events: Reports > Engagement > Events Or build a Free form exploration (with the Event name as a primary dimension and Event count as a metric) If you see the wanted event there, you’re good. If you’re still worried about the Admin > Events section because that’s the place where you can mark events as conversions, chill. You can configure conversions in Admin > Conversions. Go the, click New conversion event, and enter the event name manually there. <img class=\"alignnone size-full wp-image-21145\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-2023-02-23T105210.942.jpg\" alt=\"\" width=\"1131\" height=\"476\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-2023-02-23T105210.942.jpg 1131w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-2023-02-23T105210.942-300x126.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-2023-02-23T105210.942-768x323.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-2023-02-23T105210.942-1024x431.jpg 1024w\" sizes=\"(max-width: 1131px) 100vw, 1131px\" /> #7. Data is sent to the wrong GA4 property Another mistake that can happen even to the best of us. The troubleshooting process for this issue depends on how you have installed Google Analytics 4. First, go to Admin > Data Streams and check the Measurement ID there. It starts with “G-” <img class=\"alignnone size-full wp-image-19221\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/08/image-100.jpg\" sizes=\"(max-width: 1163px) 100vw, 1163px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/08/image-100.jpg 1163w, https://www.analyticsmania.com/wp-content/uploads/2022/08/image-100-300x60.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/08/image-100-768x153.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2022/08/image-100-1024x204.jpg 1024w\" alt=\"\" width=\"1163\" height=\"232\" /> Now check either your GA4 tags in Google Tag Manager or the measurement ID in your GTAG (in the source code of the website. I talk more about this here). If the measurement ID is not matching, that might be the cause of your problem. Don’t know how to check how GA4 is installed on your website? Read this article. #8. Event parameters are not appearing in reports Maybe you have a different situation: you are seeing the incoming events, and you are sending additional parameters with them. But for some reason, you cannot see them in GA4 reports. You go to Reports > Engagement > Events > click a particular event, and there you can see the parameters only from the last 30 minutes. <img class=\"alignnone wp-image-21067 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-74.jpg\" alt=\"\" width=\"391\" height=\"411\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-74.jpg 407w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-74-285x300.jpg 285w\" sizes=\"(max-width: 391px) 100vw, 391px\" /> If you are sending custom event parameters to Google Analytics 4 (that are not mentioned in the documentation or here), they need to be registered as custom dimensions. Only then you will start seeing the parameters in the reports. However, remember that it will take up to 48 hours for the custom dimension to start populating data. Also, the custom dimension will not apply to the data collected before you created the dimension. Learn more about custom dimensions in GA4 here. Other useful resources This is not the first (and probably not the last) troubleshooting article for Google Analytics 4. Here are two more blog posts that might help you with challenges: What to do if GA4 debugview is not working? What to do if GA4 real-time reports are not working? Google Analytics 4 Events Not Showing: Final words These were the main reasons why Google Analytics 4 events are not showing up in your reports. I try to keep this list updated, so if none of the tips helped you, please post a comment below and describe your situation. I might update the article and add more ideas in the future. If you managed to troubleshoot the situation yourself and found a new solution/reason, please post a comment too. I might include that tip in this blog post as well.","metadata":{"source":"https://www.analyticsmania.com/post/google-analytics-4-events-not-showing-up-in-reports/","title":"Google Analytics 4 Events Not Showing Up in Reports?","date":"2023-02-23T01:56:17+00:00","contentLength":2136}},{"pageContent":"Google Analytics 4 has far fewer built-in reports than its predecessor (Universal Analytics). However, you can customize and adapt the reports according to your needs. The customization process is not perfect (I will talk about that, too), but it can still cover many use cases. In this tutorial, I will show you how to customize reports in Google Analytics 4 and share several ideas to get started. Note: this article applies to standard reports only (a.k.a. the Reports section on the left sidebar). If you want to learn about Explorations (the Explore section of the left sidebar), read this article instead. <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2022/10/700px-Subscribe-and-Get-the-Ebook-Real-Book-Img-GA4-migration.jpg\" alt=\"Subscribe and Get the Ebook - GA4 migration\" /> Table of contents – Hide table of contents – Two types of standard reports Where to start? Customize a single report in Google Analytics 4 Saving changes in the report Library in GA4 Create a new report in Google Analytics 4 Examples of customized reports Mobile traffic Google Search Console report Site search terms Limitations Final Words Video tutorial If you prefer video content, here’s a tutorial from my Youtube channel. Two types of standard reports There are two types of standard reports in GA4, detail reports (where the main focus is on the table and charts. Example: Reports > Engagement > Events) and overview (where you see cards/widgets. Example: Reports > Engagement > Engagement overview). Here’s an example of a detail report. <img class=\"alignnone wp-image-20959 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-33.jpg\" alt=\"\" width=\"703\" height=\"530\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-33.jpg 903w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-33-300x226.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-33-768x579.jpg 768w\" sizes=\"(max-width: 703px) 100vw, 703px\" /> And here’s an example of an overview report. <img class=\"alignnone size-full wp-image-20960\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-34.jpg\" alt=\"\" width=\"1234\" height=\"779\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-34.jpg 1234w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-34-300x189.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-34-768x485.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-34-1024x646.jpg 1024w\" sizes=\"(max-width: 1234px) 100vw, 1234px\" /> Where to start? There are two places where you can customize the reports: You can either open any standard report (in the Reports section) and then click the Customize report button Or you can go to the Library and create/edit reports there Remember, customized reports are visible to all users of a Google Analytics 4 property. Customize a single report in Google Analytics 4 To customize any single report, go to that report and click the Customize report button in the top-right corner. <img class=\"alignnone wp-image-20962 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-35.jpg\" alt=\"\" width=\"258\" height=\"137\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-35.jpg 324w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-35-300x159.jpg 300w\" sizes=\"(max-width: 258px) 100vw, 258px\" /> If you don’t see the button there, this means you don’t have enough permissions in that property. After you click the button, the interface will switch to report-editing mode. On the right side, a sidebar will appear containing the following sections: Report data (where you can manage dimensions and metrics). Available if you are editing the Detail report. Report filter. Available in the Detail report. Charts. Available in the Detail report. Report template. Available in the Detail report and an Overview report. Summary cards. Available in the Detail report. Cards. Available in an Overview report. Dimensions. To add/remove primary dimensions, click the Dimensions button in the Report data section. These dimensions will be displayed as the first column of the report table. If multiple dimensions are included in this list, GA users will be able to select them in the dropdown of the first column. <img class=\"alignnone wp-image-20963 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-36.jpg\" alt=\"\" width=\"662\" height=\"458\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-36.jpg 833w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-36-300x207.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-36-768x531.jpg 768w\" sizes=\"(max-width: 662px) 100vw, 662px\" /> Currently, you cannot add secondary dimensions directly in the customization (so that both dimensions would be displayed by default). Metrics. Metrics are numbers that will be displayed in all other report columns. However, not all combinations of dimensions and metrics are possible. For example, you cannot combine item-scoped metrics/dimensions with event-scoped metrics/dimensions (e.g. item name and event count). Report filter lets you add conditions and show a subset of your data. You can add up to 5 conditions in a filter. An example of a filter could be “Include hostname xxxxx.com” (this would show data only tracked on that hostname, rather than all websites tracked by this GA property). <img class=\"alignnone wp-image-20964 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-37.jpg\" alt=\"\" width=\"263\" height=\"370\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-37.jpg 319w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-37-213x300.jpg 213w\" sizes=\"(max-width: 263px) 100vw, 263px\" /> Charts. Honestly, the current options of data visualizations in standard reports are not good: bar chart, line chart, and scatter chart (I haven’t met a person who likes/uses scatter chart in GA). The problem with these charts is that they visualize the top 5 rows of your report. Instead, I would like to see a line chart where I can see the total numbers of a particular metric (e.g. total number of pageviews), but that is not available now. Usually, I use this section to hide the charts and focus only on the table. You can hide visualizations by clicking the eye icons next to the chart name. And if you want to replace one chart type with another, click the chart name and select a different option. <img class=\"alignnone wp-image-20965 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-38.jpg\" alt=\"\" width=\"291\" height=\"301\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-38.jpg 418w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-38-290x300.jpg 290w\" sizes=\"(max-width: 291px) 100vw, 291px\" /> Report template. Occasionally, Google publishes updates to their standard reports (sometimes, they might even break them). So if your report is linked to a standard template, it will be displayed like this: <img class=\"alignnone wp-image-20966 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-39.jpg\" alt=\"\" width=\"253\" height=\"229\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-39.jpg 310w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-39-300x272.jpg 300w\" sizes=\"(max-width: 253px) 100vw, 253px\" /> But sometimes, you might want to customize a report so that the link will eventually have to be broken. But don’t worry. If you ever want to rebuild the report, you can create a new one from the library (I will cover the GA4 library later in this blog post). Summary cards. This is the section where you should be able to add summary cards, at least in theory. However, when I tried to add a summary card to a Detail report, none of my cards was displayed. Maybe there’s a bug, or maybe I am missing something. <img class=\"alignnone size-full wp-image-20967 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-40.jpg\" alt=\"\" width=\"305\" height=\"113\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-40.jpg 305w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-40-300x111.jpg 300w\" sizes=\"(max-width: 305px) 100vw, 305px\" /> Cards. Here you can add up to 16 cards (if you are customizing/building an overview report). You are free to rearrange them, and if you want to add a card, click Add cards and then select from one of the available templates. If one of the card templates has a number in it (e.g. +1 or +2), this means that there will be more than one metric available in the card. <img class=\"alignnone wp-image-20969 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-42.jpg\" alt=\"\" width=\"859\" height=\"456\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-42.jpg 1002w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-42-300x159.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-42-768x408.jpg 768w\" sizes=\"(max-width: 859px) 100vw, 859px\" /> Last (but not least), you can rearrange cards by dragging this icon: <img class=\"alignnone wp-image-20970 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-43.jpg\" alt=\"\" width=\"254\" height=\"283\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-43.jpg 320w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-43-270x300.jpg 270w\" sizes=\"(max-width: 254px) 100vw, 254px\" /> Saving changes in the report Once you are done with the changes, click Save at the top right corner. Here you can select whether you want to save changes in the current report (or do you want to save it as a new report). <img class=\"alignnone wp-image-20971 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-44.jpg\" alt=\"\" width=\"258\" height=\"194\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-44.jpg 317w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-44-300x225.jpg 300w\" sizes=\"(max-width: 258px) 100vw, 258px\" /> However, keep in mind that saving a new report will not make it visible on the sidebar. You will need to publish it later (and that’s where you must become familiar with Library). Library in GA4 Library is a place where you can manage your standard reports (default and customized). Here you can group those reports into topics and collections and decide which reports are published (meaning they will be visible on the sidebar). Collection is a top level of standard reports. By default, GA4 shows two collections of reports: Lifecycle and User (but of course, there is a chance that in the future, this setting might be expanded). If we drill down a bit, the next (lower) level is Topic. One collection can consist of several topics. For example, Lifecycle collection (by default) contains Acquisition, Engagement, Monetization topics. Each topic consists of a set of reports. <img class=\"alignnone wp-image-20972 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-46.jpg\" alt=\"\" width=\"537\" height=\"341\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-46.jpg 613w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-46-300x190.jpg 300w\" sizes=\"(max-width: 537px) 100vw, 537px\" /> To get started, go to Reports > Library. Here you will see a list of available (published and unpublished) collections. Inside a card of each collection, you will see a list of topics. <img class=\"alignnone wp-image-20973 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-47.jpg\" alt=\"\" width=\"797\" height=\"314\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-47.jpg 964w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-47-300x118.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-47-768x303.jpg 768w\" sizes=\"(max-width: 797px) 100vw, 797px\" /> Below that list, you will see Reports. All of the default reports will already be there. Create a new report in Google Analytics 4 If you want to create a new GA4 collection, first, you need to click a large Create new collection button. To add a report to an existing collection, click Edit collection. <img class=\"alignnone wp-image-20975 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-48.jpg\" alt=\"\" width=\"579\" height=\"301\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-48.jpg 652w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-48-300x156.jpg 300w\" sizes=\"(max-width: 579px) 100vw, 579px\" /> However, before you do that, first, you have to create the actual report. Let’s say we want to build a report of only one subdomain (because maybe our property is collecting data from multiple subdomains). This will be a lightweight workaround for the views of Universal Analytics. Click Create new report and then choose to Create detail report. <img class=\"alignnone wp-image-20976 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-49.jpg\" alt=\"\" width=\"222\" height=\"135\" /> Let’s say that in this report, we will be focusing on our top traffic sources. Select the Traffic acquisition template. <img class=\"alignnone wp-image-20977 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-50.jpg\" alt=\"\" width=\"823\" height=\"468\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-50.jpg 990w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-50-300x171.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-50-768x437.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-50-440x250.jpg 440w\" sizes=\"(max-width: 823px) 100vw, 823px\" /> If you want, you can add/remove metrics and dimensions. In the Report filter, click Add filter and enter the following condition (obviously, you should use a different value of the hostname): <img class=\" wp-image-20978 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-51.jpg\" alt=\"\" width=\"261\" height=\"419\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-51.jpg 318w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-51-187x300.jpg 187w\" sizes=\"(max-width: 261px) 100vw, 261px\" /> Click Apply. Once you are done with customizations, click Save and enter the report’s name, for example, Traffic sources: aaa.xxx.com. Click Save. Now, click Back and edit the collection where you want to include that report (because the report you just saved is still not included/visible in the left sidebar). Let’s say I want to create a collection of reports just for the www.analyticsmania.com subdomain. That’s why I’ll click Create new collection > Blank. Enter the name of your collection by clicking here: <img class=\"alignnone wp-image-20979 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-52.jpg\" alt=\"\" width=\"512\" height=\"319\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-52.jpg 605w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-52-300x187.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" /> Then you have to create at least one topic. In this case, I will enter “Traffic sources”. After you create the topic, find your recently created report on the right and drag it to the left sidebar. <img class=\"alignnone wp-image-20980 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-53.jpg\" alt=\"\" width=\"747\" height=\"465\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-53.jpg 890w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-53-300x187.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-53-768x478.jpg 768w\" sizes=\"(max-width: 747px) 100vw, 747px\" /> When you are done, click Save. Once you are done adding new reports to that collection, click three dots in the card of that new collection > Publish. This will make the collection and all of its reports visible on the left sidebar. <img class=\"alignnone wp-image-21000 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-64.jpg\" alt=\"\" width=\"386\" height=\"260\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-64.jpg 440w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-64-300x202.jpg 300w\" sizes=\"(max-width: 386px) 100vw, 386px\" /> However, I could not find a way to rearrange collections. Hopefully, Google will add this in the future. And that’s how you create or customize reports in Google Analytics 4. If you want to delete the report, click three dots next to that report in the Library. <img class=\"alignnone wp-image-20981 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-54.jpg\" alt=\"\" width=\"629\" height=\"338\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-54.jpg 766w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-54-300x161.jpg 300w\" sizes=\"(max-width: 629px) 100vw, 629px\" /> Examples of customized reports To give you some inspiration, here are several examples/ideas of what you can customize in GA4. I have already shown how to view data only of a particular subdomain/hostname. But here are several more. Report of pages visited by mobile traffic in Google Analytics 4 The easiest way to achieve this would be to open a standard report in Reports > Engagement > Pages and then click Customize report. Then keep all the settings as they are and add a filter: device category is mobile. Click Apply. <img class=\"alignnone wp-image-20983 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-55.jpg\" alt=\"\" width=\"282\" height=\"364\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-55.jpg 316w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-55-232x300.jpg 232w\" sizes=\"(max-width: 282px) 100vw, 282px\" /> Then click Save > Save as new report and give it a name (e.g. Pages on mobile). Go back to Reports > Library and edit the Life cycle collection (if you want to include the report in that collection). Now drag the newly created report to the Engagement topic and save the changes to the current collection. <img class=\"alignnone wp-image-20984 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-56.jpg\" alt=\"\" width=\"582\" height=\"375\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-56.jpg 756w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-56-300x193.jpg 300w\" sizes=\"(max-width: 582px) 100vw, 582px\" /> Done! Your report will look like this, and it can be accessed by going to Reports > Engagement > Pages on mobile. All users of that GA4 property will be able to see/access that report. <img class=\"alignnone wp-image-20985 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-57.jpg\" alt=\"\" width=\"267\" height=\"409\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-57.jpg 327w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-57-196x300.jpg 196w\" sizes=\"(max-width: 267px) 100vw, 267px\" /> Google Search Console report If you have connected Google Search Console to your GA4 property, this connection automatically creates a new collection. Go to Reports > Library and keep looking for Search Console. Then click three dots next to it and hit Publish. <img class=\"alignnone wp-image-20986 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-58.jpg\" alt=\"\" width=\"859\" height=\"316\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-58.jpg 981w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-58-300x110.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-58-768x283.jpg 768w\" sizes=\"(max-width: 859px) 100vw, 859px\" /> Honestly, I am surprised that this is needed at all. If I connect Search Console with GA4, I would expect to start seeing this report collection by default on the sidebar. Site search terms If your website has a site search and you are tracking that with Google Analytics 4, you will have view_search_results in your reports. However, it would be more convenient to see a dedicated report just for that event where the primary dimension is Search Term. Luckily, with this customization feature, you can do that (although there are some caveats). Let’s create a new report. Go to Reports > Library > Create new report > Create detail report > Blank. In the Dimensions section, add the following: Search term. Click Apply. <img class=\"alignnone wp-image-20988 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-59.jpg\" alt=\"\" width=\"272\" height=\"232\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-59.jpg 314w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-59-300x256.jpg 300w\" sizes=\"(max-width: 272px) 100vw, 272px\" /> In the Metrics section, add the following metrics: Event count, Total users. If you want, you can also add Event count per user (maybe some users search the same thing multiple times). <img class=\"alignnone wp-image-20989 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-60.jpg\" alt=\"\" width=\"258\" height=\"299\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-60.jpg 311w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-60-259x300.jpg 259w\" sizes=\"(max-width: 258px) 100vw, 258px\" /> Unfortunately, when I was writing this article, we could not create a filter that would include only view_search_results event. Maybe that will be fixed in the future, so go ahead and try creating a filter. But in my case, the Event name dimension is not available in the filters. Hide all charts by clicking Eye icons next to them. Click Save and give this report a name, e.g. Site search. Finally, go back to the library and include this report in one of the collections (e.g. Life cycle > Engagement). The final report will look like this: <img class=\"alignnone size-full wp-image-20990\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-61.jpg\" alt=\"\" width=\"1137\" height=\"556\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-61.jpg 1137w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-61-300x147.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-61-768x376.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-61-1024x501.jpg 1024w\" sizes=\"(max-width: 1137px) 100vw, 1137px\" /> The reason why the first row of the report is empty is that we could not filter the data based on the event name. So right now, the first row includes all events that are not view_seach_results. The only thing we can do now is to ignore that row. All other rows, on the other hand, will show proper data of how many times each keyword was searched and how many users were interested. <img class=\"alignnone size-full wp-image-20991\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-63.jpg\" alt=\"\" width=\"1137\" height=\"556\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/02/image-63.jpg 1137w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-63-300x147.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-63-768x376.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2023/02/image-63-1024x501.jpg 1024w\" sizes=\"(max-width: 1137px) 100vw, 1137px\" /> Limitations Report customization in Google Analytics 4 has potential, but some important things are still missing. For example, the previous example of site search keyword report. I wish we could create a filter based on the event name. That way, I could build a report on particular event(s). Another limitation is that I cannot reuse the same report template in multiple GA4 properties/accounts. I wish I could build a custom collection and then export/import it to other properties. This feature would be very helpful for freelancers and agencies working with multiple clients. Customize Standard Reports in Google Analytics 4: Final Words In conclusion, the customization of reports in GA4 can help you polish a lot of rough edges that the standard reports have. That way, you can tailor the interface to the needs of the users who will be using the data. However, if you are working with multiple clients, repeating the same customization process over and over again will be cumbersome. Hopefully, that will be addressed in the future. In the meantime, start thinking about what customized reports you can create now. And if you want to go more advanced, start diving deeper into explorations, e.g. Free form or Funnel explorations. <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2022/10/700px-Subscribe-and-Get-the-Ebook-Real-Book-Img-GA4-migration.jpg\" alt=\"Subscribe and Get the Ebook - GA4 migration\" />","metadata":{"source":"https://www.analyticsmania.com/post/customize-reports-in-google-analytics-4/","title":"How to Customize Reports in Google Analytics 4","date":"2023-02-17T15:50:27+00:00","contentLength":4268}},{"pageContent":"Updated: February 12th, 2023 Compared to Universal Analytics, Google Analytics is missing a lot of predefined reports that we are familiar with (e.g. landing page, site search, etc.). I don’t know if this will change in the future, but I hope so! In the meantime, we got a pretty powerful suite of reporting capabilities called Analysis Hub. Later Analysis hub was renamed to simply “Explorations”. It’s the place where you can do ad-hoc analysis and dig deeper into your data. In today’s blog post, I wanted to focus on one particular part of it, Free Form Reports in Google Analytics 4. Table of contents – Hide table of contents – Main components Variables Segments Dimensions and metrics Tab settings Segment comparisons Rows Columns Values Filters The Output (report) Examples of Exploration reports Landing pages report Order coupon code report Additional things Final words Tutorials about other explorations reports in GA4 I have also published several other tutorials that you might find useful: Funnel exploration in Google Analytics 4 Path exploration in Google Analytics 4 Video tutorial If you prefer video content, feel free to take a look at this tutorial on my Youtube channel. However, keep in mind that this blog post contains some additional tips (compared to the video). #1. Main components To get started, log in to your Google Analytics 4 property click Explore on the left sidebar. Then select Free Form (or Blank). If you choose Free Form, you will see a sample report with some configuration. And with Blank, well, you’ll get a blank piece of paper to start from scratch. The interface in the Explorations (previously known as Analysis Hub) is split into 3 main parts/columns: Variables Tab settings The output (the report that you is generated based on your configuration) <img class=\"alignnone size-full wp-image-15569\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/04/image-2021-02-03T174306.719.jpg\" alt=\"\" width=\"1408\" height=\"787\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/04/image-2021-02-03T174306.719.jpg 1408w, https://www.analyticsmania.com/wp-content/uploads/2020/04/image-2021-02-03T174306.719-300x168.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/04/image-2021-02-03T174306.719-768x429.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/04/image-2021-02-03T174306.719-1024x572.jpg 1024w\" sizes=\"(max-width: 1408px) 100vw, 1408px\" /> Let’s take a closer look at each part. #1.1. Variables This has nothing to do with Google Tag Manager’s variables. The Variables section in the GA4 Free Form reports is the place where you select data that you plan to use in a report: Date range Segments Dimensions Metrics Also, you can change the name of the analysis in the top-left corner of the interface. <img class=\"alignnone wp-image-15601 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T150803.686.jpg\" alt=\"\" width=\"268\" height=\"190\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T150803.686.jpg 325w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T150803.686-300x212.jpg 300w\" sizes=\"(max-width: 268px) 100vw, 268px\" /> To select a different date range, click the date in the top-left corner (below the analysis name) and select whatever you need (like “last 7 days”, “Last 30 days”, etc.). <img class=\" wp-image-15602 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T150839.830.jpg\" alt=\"\" width=\"264\" height=\"187\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T150839.830.jpg 325w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T150839.830-300x212.jpg 300w\" sizes=\"(max-width: 264px) 100vw, 264px\" /> #1.1.1. Segments If you want to compare how different groups of your users/visitors are behaving, you should include those segments in the Segments section first (I will later show how to add them to the actual report). You can choose from several segments that are already included or you can add your own. You can do that by clicking the plus icon: <img class=\" wp-image-15603 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T150918.841.jpg\" alt=\"\" width=\"241\" height=\"251\" /> Then you can either create a custom segment or select a suggested one. <img class=\"alignnone size-full wp-image-15604\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151001.517.jpg\" alt=\"segments in google analytics 4 analysis hub\" width=\"741\" height=\"580\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151001.517.jpg 741w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151001.517-300x235.jpg 300w\" sizes=\"(max-width: 741px) 100vw, 741px\" /> Speaking of custom segments, there are 3 types: User segment where you can include data of all users that match certain user criteria. Example: show all events of users who are from the US. This is equivalent to user segments in Universal Analytics. Session segment where you can include data of sessions that match certain criteria. Example: show all events of sessions where visitors downloaded an ebook. This is equivalent to session segments in Universal Analytics. Event segment where you include ONLY events based on certain criteria. This was not available in Universal Analytics. Example: Show data of all events that are lead_generated. #1.1.2. Dimensions and metrics Dimensions in Google Analytics are parameters/attributes of an event, product, transaction, user, etc. Basically, they are attributes that describe something. For example: Event name Transaction ID User’s pricing plan Product category, etc. Metrics help us measure. For example, how many events were made yesterday, how many transactions were complete last week, what was the conversion rate last month, etc. Speaking of the actual metric names (and examples) that you can find in GA4, here are some examples: Event count Number of active users Number of transactions Engagement rate Now that we got some very basics, here’s the catch in the Analysis hub. If you want to use a metric or a dimension in any analysis technique within that report, you have to include the dimension/metric in the Variables column first. You can do that by clicking the Plus icon and then selecting what you need. After you select the needed metric/dimension, click Apply button in the top-right corner. <img class=\"alignnone size-full wp-image-15605\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151215.240.jpg\" alt=\"add dimensions to ga4 analysis hub\" width=\"839\" height=\"301\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151215.240.jpg 839w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151215.240-300x108.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151215.240-768x276.jpg 768w\" sizes=\"(max-width: 839px) 100vw, 839px\" /> By the way, some analysis techniques might not allow you to use certain parts of the Variables column. Example: Funnel report does not allow to include/use metrics. To sum up, the Variables column is responsible for the data input. If you want to use some segments/metrics/dimensions, they must be included in that column. If you are missing something later down the line, you can add new items on-the-fly. Also, you can change the date range (which, obviously, also affects the scope of data input). #1.2. Tab settings In this column, you can configure what the report will look like. First, there is a Technique drop-down menu (where you can select from things like Free Form, Funnel Exploration, etc.). In this blog post, I focus only on the Free Form part. Then you will find the visualization section where you can select from: Table Donut chart Line chart Scatterplot Bar chart Geo map <img class=\"alignnone wp-image-16847 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-08-09T143953.057.jpg\" alt=\"\" width=\"364\" height=\"257\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-08-09T143953.057.jpg 457w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-08-09T143953.057-300x212.jpg 300w\" sizes=\"(max-width: 364px) 100vw, 364px\" /> Each visualization method affects which customization options will be available in that very same column. I usually find myself working with the Table, thus it will get most of my attention in this blog post. But before that, let me briefly mention some unique settings available in the Line Chart. Line chart allows you to select the level of granularity (hour, day, week, month). Also, by default, anomaly detection is enabled. This means that you can quickly see if something is not right. There are even two ways how you can tweak it: Training period (the longer the period, the more data will be taken into account while calculating the expected value). That’s why I set higher values here. Sensitivity. The higher it is, the narrower the area of the expected value will be. <img class=\" wp-image-15607 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151519.717.jpg\" alt=\"anomaly detection in google analytics 4 exploration report\" width=\"203\" height=\"663\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151519.717.jpg 229w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151519.717-92x300.jpg 92w\" sizes=\"(max-width: 203px) 100vw, 203px\" /> Now back to the Table visualization. #1.2.1. Segment comparisons In the Segment comparisons section, you can include up to 4 segments that are already included in the Segments section of the Variables tab. You can add segments to the Tab Settings column by dragging them from the Variables tab. Also, you can just do double-click in the Variables tab and they will be added automatically. If you have at least one segment added to the comparisons section, a new field will appear, Pivot. This field is responsible for the placement of segments in the table. It offers 4 options: first row, last row, first column, last column. To better explain the difference, let me show you an example. I have a Free Form report where: Two segments are selected: US visitors and Non-US visitors Browser dimension is in the Rows section Device category dimension is in the Columns section Active users is the only metric All other settings are default. Now I will show you 4 different screenshots. One for each pivot option. Pivot – first row. The segment is displayed first in every row. <img class=\"alignnone size-full wp-image-15584\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-row-google-analytics-4-exploration-report-1.jpg\" alt=\"\" width=\"1227\" height=\"696\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-row-google-analytics-4-exploration-report-1.jpg 1227w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-row-google-analytics-4-exploration-report-1-300x170.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-row-google-analytics-4-exploration-report-1-768x436.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-row-google-analytics-4-exploration-report-1-1024x581.jpg 1024w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-row-google-analytics-4-exploration-report-1-440x250.jpg 440w\" sizes=\"(max-width: 1227px) 100vw, 1227px\" /> Pivot – last row. Segment comes last after all dimensions in a row. <img class=\"alignnone size-full wp-image-15585\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-row-google-analytics-4-exploration-report.jpg\" alt=\"\" width=\"1143\" height=\"726\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-row-google-analytics-4-exploration-report.jpg 1143w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-row-google-analytics-4-exploration-report-300x191.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-row-google-analytics-4-exploration-report-768x488.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-row-google-analytics-4-exploration-report-1024x650.jpg 1024w\" sizes=\"(max-width: 1143px) 100vw, 1143px\" /> Pivot – first column. A segment is visible in the first row in each column. <img class=\"alignnone size-full wp-image-15586\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-column-google-analytics-4-exploration-report.jpg\" alt=\"\" width=\"1186\" height=\"675\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-column-google-analytics-4-exploration-report.jpg 1186w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-column-google-analytics-4-exploration-report-300x171.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-column-google-analytics-4-exploration-report-768x437.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-column-google-analytics-4-exploration-report-1024x583.jpg 1024w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-first-column-google-analytics-4-exploration-report-440x250.jpg 440w\" sizes=\"(max-width: 1186px) 100vw, 1186px\" /> Pivot – last column. The segment name is visible below all dimensions in every column. <img class=\"alignnone size-full wp-image-15587\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-column-google-analytics-4-exploration-report.jpg\" alt=\"\" width=\"1183\" height=\"688\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-column-google-analytics-4-exploration-report.jpg 1183w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-column-google-analytics-4-exploration-report-300x174.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-column-google-analytics-4-exploration-report-768x447.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2021/02/pivot-last-column-google-analytics-4-exploration-report-1024x596.jpg 1024w\" sizes=\"(max-width: 1183px) 100vw, 1183px\" /> #1.2.2. Rows Here you can decide what dimensions do you want to use in the rows of the table. In the screenshot below, you will see what the report looks like when the Browser dimension is inserted in the Rows section. Every row of that report contains a different browser name. <img class=\"alignnone wp-image-15589 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122445.248.jpg\" alt=\"\" width=\"603\" height=\"506\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122445.248.jpg 636w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122445.248-300x252.jpg 300w\" sizes=\"(max-width: 603px) 100vw, 603px\" /> If you want, you can include multiple dimensions as rows. Then different combinations of all dimensions will be displayed as a separate row. Here’s an example of a report where I have device category and browser as two Row dimensions. <img class=\"alignnone wp-image-15590 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122650.898.jpg\" alt=\"\" width=\"573\" height=\"473\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122650.898.jpg 627w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122650.898-300x248.jpg 300w\" sizes=\"(max-width: 573px) 100vw, 573px\" /> Also, you can select from which row to start and how many rows to display at the same time. <img class=\"alignnone wp-image-15608 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151620.652.jpg\" alt=\"\" width=\"195\" height=\"248\" /> If you work with multiple dimensions, consider switching to nested rows. <img class=\"alignnone size-full wp-image-15609 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151723.097.jpg\" alt=\"\" width=\"216\" height=\"321\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151723.097.jpg 216w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151723.097-202x300.jpg 202w\" sizes=\"(max-width: 216px) 100vw, 216px\" /> Remember my previous report example with two dimensions, browser and device category? Both dimensions were displayed in the same row. If you switch to nested rows, it will look like this: <img class=\"size-full wp-image-15591 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122952.749.jpg\" alt=\"\" width=\"853\" height=\"699\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122952.749.jpg 853w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122952.749-300x246.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T122952.749-768x629.jpg 768w\" sizes=\"(max-width: 853px) 100vw, 853px\" /> #1.2.3. Columns Then you can also add dimensions as columns. Let’s continue the example of browsers and device categories. If I dragged the device category dimension from Rows to Columns, the report would look like this: <img class=\"alignnone size-full wp-image-15592\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T123543.546.jpg\" alt=\"\" width=\"903\" height=\"559\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T123543.546.jpg 903w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T123543.546-300x186.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T123543.546-768x475.jpg 768w\" sizes=\"(max-width: 903px) 100vw, 903px\" /> Now, every device category has its own column. Additionally, you can choose from which column do you want to start displaying data. Also, you can select the maximum number of columns per single dimension. For example, if a dimension has 10 unique values but you set the Show column groups to 5, only the first five dimensions will be displayed. <img class=\"alignnone size-full wp-image-15610 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151812.176.jpg\" alt=\"\" width=\"215\" height=\"239\" /> #1.2.4. Values Here you can drag metrics that you want to display as columns in the report. The maximum number of metrics added to the Values section of a single report (a.k.a. Tab in the Analysis hub) is 10. Also, you can select the cell type: Bar chart (this will show horizontal bar charts in every metric cell based on its value and the ratio to other rows in the same column) Plain text (this will display all cells without any additional visual enhancements) Heat map (this will color cells darker if their values are higher compared to other rows of the same dimension column) <img class=\"alignnone size-full wp-image-15611 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T151846.130.jpg\" alt=\"\" width=\"244\" height=\"268\" /> #1.2.5. Filters Here you can quickly narrow down the scope of data you are using. For example, maybe you want to exclude a certain event from the report? Then you can click on the placeholder and select the dimension that you are going to use in the filter. <img class=\"alignnone wp-image-15612 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T152429.048.jpg\" alt=\"filter in google analytics 4 exploration report\" width=\"335\" height=\"317\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T152429.048.jpg 406w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T152429.048-300x284.jpg 300w\" sizes=\"(max-width: 335px) 100vw, 335px\" /> Let’s say that I have a report of events and I want to exclude scrolling events. In that case, I would have to select Event name exactly matches scroll (or whatever name you use for that event). <img class=\"alignnone wp-image-15613 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T152558.406.jpg\" alt=\"\" width=\"328\" height=\"237\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T152558.406.jpg 376w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T152558.406-300x217.jpg 300w\" sizes=\"(max-width: 328px) 100vw, 328px\" /> If multiple filters are included in the report, ALL of them apply to the data. #1.3. The Output (report) Once you configure all the necessary things in the Variables and Tab Settings columns, the report should appear. Here you can do several things. Add new tabs if needed. Every tab can use a different analysis technique (free form, funnel exploration, etc.). Also, duplicate and delete them by clicking the Triangle icon next to a tab name: <img class=\"alignnone wp-image-15614 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T152758.818.jpg\" alt=\"\" width=\"491\" height=\"138\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T152758.818.jpg 612w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T152758.818-300x84.jpg 300w\" sizes=\"(max-width: 491px) 100vw, 491px\" /> Start over, undo, redo, share the report, download report: <img class=\"size-full wp-image-15615 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T153130.643.jpg\" alt=\"\" width=\"312\" height=\"131\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T153130.643.jpg 312w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T153130.643-300x126.jpg 300w\" sizes=\"(max-width: 312px) 100vw, 312px\" /> Click the metric label to change the sorting: <img class=\"alignnone size-full wp-image-15616 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T153210.339.jpg\" alt=\"\" width=\"712\" height=\"300\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T153210.339.jpg 712w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T153210.339-300x126.jpg 300w\" sizes=\"(max-width: 712px) 100vw, 712px\" /> Do the right-click on a cell to see additional options: Include selection Exclude selection Create segment from selection View users (in User Explorer report) <img class=\" wp-image-15617 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T153304.112.jpg\" alt=\"\" width=\"300\" height=\"279\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T153304.112.jpg 378w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T153304.112-300x279.jpg 300w\" sizes=\"(max-width: 300px) 100vw, 300px\" /> Include only selection will add an Include filter (or multiple filters if needed) to the report based on which cell did you click. For example, you can quickly narrow down your report to users, events, etc. Exclude selection will add an Exclude filter (or multiple filters if needed) to the report based on which cell did you click. If you accidentally included or excluded selection, you can delete those newly added filters from the Filters section in the Tab Settings column. Or you can click the Undo icon in the top-left corner of the report. If you click the Create segment option, you will see an interface of segment creation will some conditions will be prefilled. View users option will open a user explorer report with users that belong to that particular selection. In my screenshot, that option is disabled because I was working with the official GA4 demo account where this feature is not available. #2. Examples of Free Form reports in Google Analytics 4 Let’s create two sample reports that will help you better understand how Free Form reports (with Table visualization) work. Landing page report Coupon codes + revenue #2.1. Landing pages report If you are an avid Universal Analytics user, you probably visit the Landing Pages report quite often, therefore, you probably miss at least part of it in Google Analytics 4. Because of an entirely different data model, the Landing Page dimension does not exist anymore. But at the same time, GA4 tracks events called session_start. So what we could do is to create a report where we include only session_start events and display page URLs on which these pages occurred. Important: the definition of a session is very different between GA4 and Universal Analytics. In UA, many things can affect sessions (UTM parameters, referrer, etc.). In GA4, a session always ends after 30 minutes of inactivity. As a result, your landing page data in GA4 and UA will be quite different. So here are the settings of the Landing pages report in GA4: Technique: Free Form Visualization: Table Segment comparisons: None Rows: Page Path (you might need to add it to the Variables column) Values: Event Count, Users Filters: Event name exactly matches session_start I left all other settings as they are. This report is a bare minimum of what you could do. Feel free to add more metrics. The final report will look like this (click the image to view it in greater detail): <img class=\"alignnone size-full wp-image-15593\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T131953.703.jpg\" alt=\"\" width=\"1055\" height=\"767\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T131953.703.jpg 1055w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T131953.703-300x218.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T131953.703-768x558.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T131953.703-1024x744.jpg 1024w, https://www.analyticsmania.com/wp-content/uploads/2021/02/image-2021-02-04T131953.703-825x600.jpg 825w\" sizes=\"(max-width: 1055px) 100vw, 1055px\" /> I have hidden some fields (from the screenshot above) that I did not use (just so that you could see all the edited settings in the same screenshot. #2.2. Order coupon code report If you have implemented Ecommerce tracking in Google Analytics 4, you might be tracking not only purchases but also order coupons that were used at the checkout. If you want to see the report of coupon codes in GA4, here’s what you could do. This report will show the list of coupon codes that were used and the total value of all orders where those coupons were applied. Obviously, keep in mind that Google Analytics reports will not be as nearly as accurate as your payment gateway’s reports or something else that allows you to view the data in the backend. So here are the settings of the order coupon code report in GA4: Technique: Free Form Visualization: Table Segment comparisons: None Rows: Order coupon (you will need to add it to the Variables column) Values: Transactions, Total Revenue Filters: Event name exactly matches purchase Then you might see a lot of (not set) values. Do the right-click on them and select Exclude selection. This will automatically create an additional filter Order coupon does not exactly match (not set) <img class=\"size-full wp-image-15594 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/order-coupon-report-in-google-analytics-4.jpg\" alt=\"\" width=\"608\" height=\"853\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2021/02/order-coupon-report-in-google-analytics-4.jpg 608w, https://www.analyticsmania.com/wp-content/uploads/2021/02/order-coupon-report-in-google-analytics-4-214x300.jpg 214w\" sizes=\"(max-width: 608px) 100vw, 608px\" /> #3. Additional things Some of the following tips were already mentioned in this guide but I just wanted to quickly remind you about them. If you go too far with the report and want to quickly start from scratch, click Start over in the top-right corner of the Analysis Hub Want to undo one change? Use the undo button (arrow back) in the top-right corner of the Analysis hub. Undid too much? Click the redo button (arrow forward). By default, your Analysis Hub reports are visible only to you. If you want to share the report (with Read-only permissions), click the Share icon in the top-right corner. Then other users who have access to the property will be able to see it as well (but not edit it) in the list of Analysis hub. If you want to do changes to a report (created by someone else), you will have to duplicate the report first. A green shield in the top-right corner means that no sampling was applied to the report. If the shield is yellow, then sampling has kicked in. If you want to unshare the report that is already shared, in the top right corner you will see an un-share icon. You can also go to the list of all reports in the Analysis hub, click 3-dots next to that report, and then un-share. Double-click on a segment/dimension/metric in the Variables tab and it will be automatically added to the Tab Settings column. Drag a segment/dimension/metric over another metric (in the Tab Settings tab) and it will be replaced. Don’t forget to do the right click on the actual report to see what kind of options are available. This applies not only to the Exploration reports. Free Form reports in Google Analytics 4: Final words I hope that you are now more familiar with the Free Form reports in Google Analytics 4. It can definitely be tricky to get started (especially if you are not experienced with doing ad-hoc reports) but practice makes it perfect. Eventually, you will get used to it. Also, I really hope that in the near future, we will have a community template gallery for reports in the analysis hub. That would save us a lot of time. If you are reading this paragraph and you already have the community template gallery, well, then good for you 🙂 I wish I had it sooner.","metadata":{"source":"https://www.analyticsmania.com/post/exploration-reports-in-google-analytics-4/","title":"Free Form Reports in Google Analytics 4 (GA4 Explorations)","date":"2023-02-12T01:12:53+00:00","contentLength":5059}},{"pageContent":"Updated: February 10th, 2023 One of the most common use cases of Google Analytics is to view where your visitors are coming from. Even though Google Analytics 4 can show this data, some parts of the interface might be confusing compared to the previous version, Universal Analytics. That’s why I decided to publish this blog post where I will explain how to use Acquisition reports in GA4. Also, at the end of it, I will share several tips that will help you work with these reports faster. Table of contents + Show table of contents + Why are these reports important? Overview Navigating acquisition reports Default channel grouping User acquisition vs Traffic Acquisition Do not use Source, Medium, Campaign How to customize acquisition reports? Additional tips Zoom out Quickly replicate the report in Explorations Final words Video tutorial If you prefer video content, here’s a tutorial from my Youtube channel. Why are Acquisition reports important? If you are not sure what you can achieve with these reports, here are several ideas. Identify top performers. What is a “top performer”? Well, this is up to you and your company to decide. If you are an e-commerce business, the top-performing sources will be the ones that generate the most sales/revenue and generate the most email subscribers. By identifying them, you might try to raise the hypothesis of what is common among top performers. Then try to replicate that success to other marketing channels (if possible). Identify the weak spots. Instead of focusing on “what works best”, you can focus on “what performs the worst”. That might help identify weak spots that should be fixed. For example, you can check which traffic sources have more than 10000 monthly visitors, but convert worse than average. Another example of weak spots could be traffic sources that get a lot of traffic but have a low engagement rate. That might indicate that maybe the landing page does not meet the visitor’s expectations. Evaluate your campaigns. With UTM parameters, you can mark your marketing campaigns with certain parameters (like utm_source, utm_medium, etc.). When that data is collected by GA4, you can see the results in acquisition reports. For example, which campaign/ad generated the most leads for your business? Overview of Acquisition reports You can find these reports by going to Reports > Acquisition. By default, there are 3 options: Overview User acquisition Traffic acquisition <img class=\"alignnone wp-image-19736 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-54.jpg\" alt=\"\" width=\"259\" height=\"246\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-54.jpg 343w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-54-300x285.jpg 300w\" sizes=\"(max-width: 259px) 100vw, 259px\" /> Overview is a dashboard of what’s going on with your website traffic. You will find there a bunch of widgets (cards). Most of them also have links that will open a more detailed report. <img class=\"alignnone size-full wp-image-19737\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-55.jpg\" alt=\"\" width=\"835\" height=\"766\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-55.jpg 835w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-55-300x275.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-55-768x705.jpg 768w\" sizes=\"(max-width: 835px) 100vw, 835px\" /> If you have connected Google Ads or Search Console to your Google Analytics 4 property, additional cards will be displayed in the overview. User acquisition and Traffic acquisition reports show you more details about traffic sources. Navigating acquisition reports Let’s go to Traffic acquisition. Here you can change the primary dimension at the top-left corner of the table… <img class=\" wp-image-19738 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-56.jpg\" alt=\"\" width=\"566\" height=\"322\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-56.jpg 691w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-56-300x171.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-56-440x250.jpg 440w\" sizes=\"(max-width: 566px) 100vw, 566px\" /> or you can add a secondary dimension by clicking the Plus icon. <img class=\"alignnone wp-image-19739 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-57.jpg\" alt=\"\" width=\"402\" height=\"232\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-57.jpg 534w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-57-300x173.jpg 300w\" sizes=\"(max-width: 402px) 100vw, 402px\" /> For example, in the Traffic acquisition report, let’s see what campaigns perform best. In this context, let’s say that the “best performer” means “drives the most conversions”. In the drop-down menu of a primary dimension, select “Session campaign”. <img class=\"alignnone wp-image-19740 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-58.jpg\" alt=\"\" width=\"422\" height=\"375\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-58.jpg 536w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-58-300x266.jpg 300w\" sizes=\"(max-width: 422px) 100vw, 422px\" /> Now scroll horizontally and see how many conversions each campaign drove. If you want to be more specific, you can select a particular conversion event name. <img class=\"alignnone wp-image-19741 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-59.jpg\" alt=\"\" width=\"639\" height=\"362\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-59.jpg 773w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-59-300x170.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-59-768x435.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-59-440x250.jpg 440w\" sizes=\"(max-width: 639px) 100vw, 639px\" /> If some of the metrics aren’t useful for you, you can customize the report (I’ll talk a bit about that later in this blog post). If you want to see source/medium and campaign at the same time, you should first select Session source/medium as the primary dimension and then click the Plus icon. Here should go to the Traffic source and then select Session campaign. <img class=\"alignnone size-full wp-image-19742\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-60.jpg\" alt=\"\" width=\"880\" height=\"433\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-60.jpg 880w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-60-300x148.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-60-768x378.jpg 768w\" sizes=\"(max-width: 880px) 100vw, 880px\" /> And done! You now see the list of all campaigns and their performance. <img class=\"alignnone size-full wp-image-19744\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-61.jpg\" alt=\"\" width=\"890\" height=\"443\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-61.jpg 890w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-61-300x149.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-61-768x382.jpg 768w\" sizes=\"(max-width: 890px) 100vw, 890px\" /> You can also you a search feature above the report table. It looks for partial matches in the first two columns (dimensions). For example, here’s how you can see all email campaigns. While having “Session campaign” as a secondary dimension and “Session source/medium” as a primary dimension, I just entered “email” in the search field. This matched all rows where “email” was mentioned. <img class=\"alignnone size-full wp-image-19745\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-62.jpg\" alt=\"\" width=\"874\" height=\"505\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-62.jpg 874w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-62-300x173.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-62-768x444.jpg 768w\" sizes=\"(max-width: 874px) 100vw, 874px\" /> Default channel grouping The default primary dimension in Traffic acquisition and User acquisition reports is either Session default channel grouping or First user default channel grouping. It’s the way how Google categorizes various traffic sources into larger groups. For example, Organic search includes traffic from search engines that are recognized by Google. If you want to learn more about what other groupings represent, read this documentation. If you have some traffic sources that are not added to any grouping, they will be displayed as Unassigned. User acquisition vs Traffic Acquisition After browsing Acquisition reports for a bit, you might be wondering what the difference is between User Acquisition and Traffic Acquisition reports. The answer is that they attribute conversions to different parts of a user journey. User acquisition report focuses on the first traffic source that led a visitor to your website. Traffic acquisition report focuses on the most recent traffic source that led a visitor to your website. If you are familiar with attribution modeling at least a bit, the user acquisition report uses first-click attribution while traffic acquisition uses last-click. That is why if you look at the dimension names in those reports, you will notice that the User acquisition report’s dimensions start with First user… and Traffic Acquisition’s start with Session… <img class=\"alignnone wp-image-19747 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-63.jpg\" alt=\"\" width=\"490\" height=\"280\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-63.jpg 627w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-63-300x171.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-63-440x250.jpg 440w\" sizes=\"(max-width: 490px) 100vw, 490px\" /> Let me explain the difference between these two reports visually. Imagine that we have a visitor who first landed on our website from Google Search, subscribed to a newsletter, and then came back the next day from an email campaign. <img class=\"alignnone size-full wp-image-19748 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-64.jpg\" alt=\"\" width=\"659\" height=\"172\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-64.jpg 659w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-64-300x78.jpg 300w\" sizes=\"(max-width: 659px) 100vw, 659px\" /> In total, we have two sessions of the same user. However, two reports will show different data. The user acquisition report will attribute both sessions to google/organic (because that’s the first source/medium the user came from). Session acquisition will attribute 1st session to google/organic, and the 2nd session will be attributed to email/newsletter (because the Traffic acquisition report cares about the traffic sources of each session individually). <img class=\"alignnone size-full wp-image-19749\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-65.jpg\" alt=\"\" width=\"841\" height=\"420\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-65.jpg 841w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-65-300x150.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-65-768x384.jpg 768w\" sizes=\"(max-width: 841px) 100vw, 841px\" /> If you are looking for a replacement for Universal Analytics (GA3) Source/Medium report, the Traffic acquisition report is the closest thing you can get in GA4. Do not use Source, Medium, Campaign Google Analytics 4 has 3 types of dimensions related to traffic sources: The ones that start with “First user” The ones that start with “Session” And the plain ones, e.g. Session, Medium, Campaign, etc. This can be confusing for those who have worked with GA3 in the past, but if you want to see sources, mediums, or campaigns of your *sessions*, you need to use dimensions that start with the word Sessions. <img class=\"alignnone wp-image-19750 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-66.jpg\" alt=\"\" width=\"373\" height=\"259\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-66.jpg 505w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-66-300x209.jpg 300w\" sizes=\"(max-width: 373px) 100vw, 373px\" /> Don’t use plain Session, Medium, Session/Medium, Campaign, and other similar dimensions. They use event scope, which is not what you are looking for. You are looking for session-scoped or user-scoped dimensions, so it’s important to use dimensions that start with that word. How to customize acquisition reports? Personally, I am not a fan of the default settings in the acquisition reports. Charts are not useful, default dimensions are not the ones I often use, and some metrics are unnecessary or missing. If you feel the same way, this article chapter is for you. Let’s say that we want to customize the Traffic acquisition report. First, open it and then click the Pencil icon in the top-right corner. <img class=\"alignnone wp-image-19751 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-67.jpg\" alt=\"\" width=\"197\" height=\"100\" /> If you don’t see the icon, it means that you do not have enough permissions in that GA4 property. A sidebar will appear on the right side. Click Dimensions. The default dimension here will be the Session default channel grouping. Personally, I like Session source/medium more. Thus I would recommend clicking 3 dots next to that dimension and settings it as default. <img class=\"alignnone wp-image-19752 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-68.jpg\" alt=\"\" width=\"234\" height=\"311\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-68.jpg 284w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-68-226x300.jpg 226w\" sizes=\"(max-width: 234px) 100vw, 234px\" /> If you want to add more session-related dimensions, you can do that by clicking Add Dimension. For example, Session manual term (a.k.a. utm_term) or Session manual ad content (utm_content) are worth consideration. Once you select the dimensions, click Apply. Next, “the numbers”. If you want to add/remove particular metrics, click Metrics on that very same right sidebar. <img class=\"alignnone wp-image-19753 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-69.jpg\" alt=\"\" width=\"238\" height=\"522\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-69.jpg 290w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-69-137x300.jpg 137w\" sizes=\"(max-width: 238px) 100vw, 238px\" /> Click X next to the metrics you don’t find useful. And if you want to add additional ones, then click Add metric. Here you can select from a lot. For example, Ecommerce purchases might be useful if you want to quickly see how many times visitors purchased on your website. If you want to change the order of dimensions/metrics, drag them with this icon. <img class=\" wp-image-19754 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-70.jpg\" alt=\"\" width=\"237\" height=\"361\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-70.jpg 282w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-70-197x300.jpg 197w\" sizes=\"(max-width: 237px) 100vw, 237px\" /> Once you are happy with your modifications, click Apply. Then charts. Personally, I don’t find the Bar chart useful, so I often disable it. The line chart could also use some improvements (e.g. I would like to see the total number of sessions, not just the top 5 sources). Maybe GA4 will fix this in the future, but maybe not. Who knows. Anyway, if you want to hide a particular chart, click the Eye icon next to it. <img class=\"alignnone wp-image-19756 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-72.jpg\" alt=\"\" width=\"220\" height=\"203\" /> When you have finished all the customizations, it’s time to publish these changes. Next to a date picker, click Save > Save changes to the current report. <img class=\"alignnone wp-image-19757 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-73.jpg\" alt=\"\" width=\"306\" height=\"157\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-73.jpg 392w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-73-300x154.jpg 300w\" sizes=\"(max-width: 306px) 100vw, 306px\" /> Then click Save and done. You have now customized the report. Another customization idea for you: include conversion rates in Acquisition reports. Learn more about that here. Additional tips Phew! We’re almost at the end of this blog post. For dessert, let me share with you a few quick tips (they might be obvious, but, hey, if even one reader benefits from this, I’m happy). Zoom out One of the problems I have with the GA4 interface is that tables are way too wide and don’t fit in on most of the screens. Thus horizontal scroll appears. And I don’t like that. Many important metrics are on the right side of the table (like Conversions or Revenue). Sure, I can rearrange them, but maybe other metrics are also useful. I would like to see them all at once. So if your screen is not large enough, consider zooming out. Yeah, I know, #captainobvious. But in my opinion, this is an underrated tip. Zoom out a bit (e.g. by holding CTRL and – ). See if that makes the report a bit better. Also, you can hide the sidebar of standard reports by clicking here: <img class=\"alignnone wp-image-19758 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-74.jpg\" alt=\"\" width=\"245\" height=\"127\" /> This will add some space. Quickly replicate the report in Explorations What if you prefer working with explorations instead? Like I do. Replicating the acquisition report from scratch will require a lot of clicks, which feels cumbersome. Luckily, there is a hidden feature in GA4 that allows you to replicate a standard report in explorations with a single click. When you are in a Traffic acquisition or User acquisition report, click this icon (it’s called Edit comparisons). <img class=\"aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/10/image-2021-10-08T143904.071.jpg\" width=\"393\" height=\"147\" /> A sidebar will appear on the right side. At the bottom of it (which is a totally unintuitive location for this), click Explore. <img class=\"aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2021/10/image-2021-10-08T144348.699.jpg\" width=\"310\" height=\"402\" /> Voilà! That very same report is recreated as a Free Form exploration. <img class=\"alignnone size-full wp-image-19759\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-2022-09-22T155503.533.jpg\" alt=\"\" width=\"988\" height=\"502\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/09/image-2022-09-22T155503.533.jpg 988w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-2022-09-22T155503.533-300x152.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2022/09/image-2022-09-22T155503.533-768x390.jpg 768w\" sizes=\"(max-width: 988px) 100vw, 988px\" /> That was a time-saver. But again, the table is too wide, and it does not fit on most screens. So consider removing unnecessary metrics, zooming out the report, or hiding the sidebars. Acquisition reports in GA4: Final words Now you are skilled enough to use acquisition reports and find what you need. I admit that the interface is not as intuitive as it could be, and it requires some customizations. But once you’re past that, you will be navigating the interface with more confidence. Some of the customizations I would recommend: Change the default primary dimension (if needed) to Session source/medium or First user source/medium Include session or user conversion rate metrics Get rid of unused charts, they just clutter the view","metadata":{"source":"https://www.analyticsmania.com/post/acquisition-reports-in-google-analytics-4/","title":"A Guide to Acquisition Reports in Google Analytics 4","date":"2023-02-10T01:59:42+00:00","contentLength":3358}},{"pageContent":"Updated: February 8th, 2023 When installed on a website (without any additional configurations), Universal Analytics (a.k.a. GA3) was tracking just page views. If you want to see any other interactions in your reports, you’d have to implement additional event tracking. To improve that, Google Analytics 4 offers more out-of-the-box interactions that are tracked without the need to change the website’s code or configure a GTM container. That suite of auto-tracking features is called Enhanced Measurement. Of course, you will still need to implement a bunch of recommended or custom events to get the most out of GA, but the enhanced measurement is a welcome addition for those who are just looking for very basics. However, there are some nuances as well (that I’ll also talk about). Table of Contents – Hide table of contents – Event tracking in GA4 What is Enhanced Measurement in GA4? What kind of events are tracked by it? Page views Scrolls Outbound clicks Site search Video engagement File downloads Form interactions Final words Video tutorial If you prefer video content, I have recorded a tutorial about Enhanced Measurement on my Youtube channel. As always, to learn the most about this topic, I recommend doing both: reading the guide and watching the video. Note: GA4 interface has slightly changed since I recorded this video. Debugview is not located at Admin > Debugview. Event tracking in GA4 Enhanced Measurement is just a small part of event tracking in Google Analytics 4. There are also things like recommended events and custom events. So if you want to learn more (and see a clearer picture), please read this guide (+ watch a video tutorial). Speaking of automatic events (but excluding enhanced measurement), there are some additional events that GA4 tracks automatically as well. You can find a full list here. On that list, you will find both app and web events. The list of automatic website events: first_visit. This is the first time a user visits a website or launches an app. session_start. When a user engages the app or website and starts a new session user_engagement. This event is fired 10 seconds after the visitor has stayed on a page. But it also might periodically fire while the app is in the foreground. You can learn more here. I didn’t mention the page_view here because I added it to the Enhanced Measurement section. And once again, if you want to see the app events, you can check them here. That was a very brief introduction to automatically tracked (but non-enhanced-measurement) events. And now, let’s move to the main topic. What is Enhanced Measurement in Google Analytics 4? Enhanced Measurement is a suite of automatic event-tracking features that allow marketers/analysts to collect more data out of the box. In the previous version of GA (called Universal Analytics), we had only pageviews. If you wanted to track some events, you had to customize your setup. Now, with Enhanced Measurement, you can have more events without configuring Google Tag Manager or editing your website’s code. Although, it’s worth noting that some of the EM events might be limited, and you will probably need to do tweaks here and there (more about that – later). When you configure a web data stream in Google Analytics 4, you have the option to use Enhanced Measurement. It is designed to help marketers get as many events in the reports as possible without the need to cooperate with developers or configure in Google Tag Manager. If you go to Admin > Data Streams > Select the web data stream, the following window will open where you will see a section called Enhanced Measurement. <img class=\"alignnone size-full wp-image-14786\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/google-analytics-4-enhanced-measurement.jpg\" sizes=\"(max-width: 1058px) 100vw, 1058px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/google-analytics-4-enhanced-measurement.jpg 1058w, https://www.analyticsmania.com/wp-content/uploads/2020/11/google-analytics-4-enhanced-measurement-300x118.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/google-analytics-4-enhanced-measurement-768x303.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/11/google-analytics-4-enhanced-measurement-1024x404.jpg 1024w\" alt=\"\" width=\"1058\" height=\"417\" /> What kind of events are tracked by Enhanced Measurement? By default, this feature is enabled and will automatically track the following events: Page view (event name: page_view) Scroll (event name: scroll) Outbound link click (event name: click with the parameter outbound: true) Site search (event name: view_search_results) Video Engagement (events: video_start, video_progress, video_complete) File Download (event name: file_download) Form interactions (event name: form_start, form_submit) If you want, you can disable/enable events individually, and you can do that by clicking the gear icon in the Enhanced Measurement section and then clicking the toggle buttons. <img class=\"wp-image-14787 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T151545.776.jpg\" sizes=\"(max-width: 515px) 100vw, 515px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T151545.776.jpg 709w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T151545.776-300x127.jpg 300w\" alt=\"\" width=\"515\" height=\"218\" /> Let’s take a closer look at each of those events. In some examples, I will show how to add some additional customizations with Google Tag Manager. Page views When the page view is sent to Google Analytics 4, the event name is page_view. Speaking of regular page views (when the page actually reloads and a browser downloads all the resources), they cannot be turned off in Enhanced Measurement. Every event tracked with GA4 (client-side) tracks also contains several parameters (they also apply to custom events): language page_location page_referrer page_title screen_resolution If you want to see the full list, take a look here. Speaking of GA4 implementation via GTM, regular pageviews are controlled via this checkbox in the GA4 Configuration tag: <img class=\"alignnone wp-image-15285 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T113418.897.jpg\" alt=\"\" width=\"396\" height=\"344\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T113418.897.jpg 510w, https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T113418.897-300x261.jpg 300w\" sizes=\"(max-width: 396px) 100vw, 396px\" /> … or by manually sending the page_view as an event: <img class=\" wp-image-15286 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T113602.449.jpg\" alt=\"\" width=\"361\" height=\"299\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T113602.449.jpg 440w, https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T113602.449-300x248.jpg 300w\" sizes=\"(max-width: 361px) 100vw, 361px\" /> As for page_view events, GA4 is now also capable of tracking History Change events (in other words, when the URL changes without the page reloading). These are very common in single-page applications/websites. However, there are some nuances here. What I’ve noticed is that a page_view event is sent to GA4 only if the URL change does not include URL fragments (#). If you notice a different behavior, please let me know. If a URL changes (without reloading the page) like this: example.com –> example.com/something, then the event will be automatically tracked by enhanced measurement. But if the URL changed from example.com to example.com/#something (contains #), then the event will not be sent (even though you might see the “History” event in the data layer). Also, it looks like even in the latest version, GA4 still cannot display the URL fragments in reports. If a URL contains #, everything that comes after it will not be displayed in the reports (you can check that in the DebugView). So if your URL contains #, it looks like you will have to use the History Change trigger in GTM. Hopefully, this will change in the future. Scrolls When a visitor scrolls below 90% of the page height, a scroll event is sent to Google Analytics. If you want to add some additional thresholds (such as 25%, 50%, etc.), you can’t do that in Enhanced Measurement. So, before you start looking into it, think about how (and if) you will use scroll data. Yes, this is quite a popular thing to implement (because of its simplicity), but for me, it’s very difficult to remember a case where I found scroll tracking in GA useful. Rants aside, if you are happy with just the 90% scroll event, then keep it enabled in Enhanced Measurement. But if you want to track additional thresholds, you can disable that feature in GA4 and send scroll events configured in GTM. Here is a full guide about it. Here’s an example of the trigger that you could use: <img class=\" wp-image-15287 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T113710.200.jpg\" alt=\"\" width=\"437\" height=\"567\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T113710.200.jpg 524w, https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T113710.200-231x300.jpg 231w\" sizes=\"(max-width: 437px) 100vw, 437px\" /> And then, create a GA4 event tag with the following settings. <img class=\"alignnone size-full wp-image-15288\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114154.987.jpg\" alt=\"\" width=\"779\" height=\"652\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114154.987.jpg 779w, https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114154.987-300x251.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114154.987-768x643.jpg 768w\" sizes=\"(max-width: 779px) 100vw, 779px\" /> I specifically used scroll as the event name and percent_scrolled parameter because that’s what the default Enhanced Measurement scroll event contains. So we are just using the same naming convention. Also, if you want to see percent_scrolled parameter in your GA4 reports, you will need to register it as a custom dimension (unless you mainly work with explorations. This dimension is available there by default.). Outbound clicks When a visitor clicks a link on your website, and that link redirects a visitor to another domain, this is considered as an outbound link click. So, whenever that happens, you will see a click event coming to your GA4 property. With this event, an additional parameter outbound (with the value “true”) is sent. The event with this parameter means that there was an outbound link click. Together with this event, a bunch of other parameters are sent: link_classes link_domain link_id link_url If your business operates on several domains, you can go to Tagging Settings (of that very same event stream) > Configure your domains and then enter the domains of your business. All the domains that are listed there will not trigger the outbound link click event. <img class=\"wp-image-15289 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114443.829.jpg\" alt=\"\" width=\"497\" height=\"439\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114443.829.jpg 639w, https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114443.829-300x265.jpg 300w\" sizes=\"(max-width: 497px) 100vw, 497px\" /> If you want to see/use link_classes, link_domain, link_id, link_url in your GA4 reports, you will need to register them as custom dimensions (unless you mainly work with explorations. This dimension is available there by default.). Site search Another event is view_search_results. This event will be sent to Google Analytics 4 if the page loads and the URL of the page contains a query parameter, such as q, s, search, query, keyword. But if you want, you can include more (up to 10). <img class=\" wp-image-14789 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T151719.202.jpg\" sizes=\"(max-width: 582px) 100vw, 582px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T151719.202.jpg 734w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-13T151719.202-300x150.jpg 300w\" alt=\"\" width=\"582\" height=\"290\" /> If the URL of the search results page is https://www.yourwebsite.com/search?key=my+search+term, then you should enter the word “key” (without quotation marks in the settings of the search event). Speaking of parameters that are sent with the search event, there is at least one, but you can configure more: search_term. This is where the search keyword will be stored. q_[additional-query-parameter]. If your search page’s URL contains more useful parameters, you can configure Enhanced Measurement to grab it too. Learn more about this below. If the URL of the search results contains more useful parameters, you can include them as well. For example, if the URL of your search results looks like this: https://www.yourwebsite.com/search?key=search+term&page=3, you could include the “page” (without quotation marks) in the 2nd field of the configuration. Then this parameter will be automatically tracked by GA4. <img class=\" wp-image-15292 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114905.068.jpg\" alt=\"\" width=\"455\" height=\"271\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114905.068.jpg 556w, https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T114905.068-300x179.jpg 300w\" sizes=\"(max-width: 455px) 100vw, 455px\" /> One more thing to know. Those additional query parameters will be captured like this: Start with q_ and then the name of the additional parameter that you configured in Enhanced Measurement In my case of the “page” additional parameter, it was captured as q_page. <img class=\" wp-image-15290 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T095541.611.jpg\" alt=\"\" width=\"564\" height=\"538\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T095541.611.jpg 682w, https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T095541.611-300x286.jpg 300w\" sizes=\"(max-width: 564px) 100vw, 564px\" /> If you want to see/use search_term and additional query parameters (e.g. q_page from my example) in GA4 reports, you must register them as custom dimensions. Update: the search_term dimension is available in Explorations by default (as Search Term). Also, if built-in search tracking is not enough and you want more (because on some websites, it won’t work), read this blog post. Video engagement Enhanced Measurement can track interactions of the embedded Youtube video on your website and then sends “video_…” events to GA4. But those embedded Youtube video players must contain the ?enablejsapi=1 parameter in their URL. And that is not always available on websites. Also, there are many other reasons why Youtube video tracking might not work out of the box. Hence you will need some tweaks. Because of those nuances, I’d say that this automatic video tracking will not work in as many cases as you might think, hence I’d personally vouch for doing that with GTM. Speaking of video tracking with Enhanced Measurement, here are the events that are automatically captured: video_start. Sent when a visitor starts watching a video. video_progress. When a viewer reaches a particular video threshold (10%, 25%, 50%, 75%). video_complete. When a visitor reaches the end of the video. Parameters that are automatically tracked by this feature: video_current_time. The current timestamp of the video where the viewer is at (in seconds) video_duration. Video duration in seconds. video_percent. The threshold of the video (without the % sign) video_provider. The value of this parameter is always “youtube”. video_title. The title of the video. video_url. This is the URL of the video. visible. Returns “1” if the player is visible on the screen while the video engagement was tracked. <img class=\"alignnone size-full wp-image-15291 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T101812.322.jpg\" alt=\"\" width=\"698\" height=\"568\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T101812.322.jpg 698w, https://www.analyticsmania.com/wp-content/uploads/2020/12/image-2020-12-11T101812.322-300x244.jpg 300w\" sizes=\"(max-width: 698px) 100vw, 698px\" /> If you want to use/see any of these in GA4 reports, you will need to register them as custom definitions. File downloads This event (file_download) is sent to GA4 when a link is clicked and that link contains one of the following file extensions: .pdf, .xls, .xlsx, .doc, .docx, .txt, .rtf, .csv, .exe, .key, .pps, .ppt, .pptx, .7z, .pkg, .rar, .gz, .zip, .avi, .mov, .mp4, .mpe, .mpeg, .wmv, .mid, .midi, .mp3, .wav, .wma. In other words, if the link opens/downloads a file. It is currently impossible to update the list with other extensions in the GA4 interface. So if you want to extend the list, you must implement it via Google Tag Manager. Here is an example of how to configure the trigger. But to learn how to configure the GA4 event tag, read this tutorial. The list of additional parameters that are automatically tracked together with the file_download event are: file_extension. The extension of the file, e.g. “pdf”, “docx”, etc. file_name. The name of the file. If the clicked URL is example.com/filename.pdf, the parameter’s value will be “filename”). link_text. The text of the link (that was clicked) to open/download the file. link_url. The URL of the file link that was clicked, e.g. https://www.example.com/filename.pdf Form interactions If your website has a form and a visitor interacts with it, Google Analytics 4 can track those interactions. But the key word here is can. Unfortunately, in many cases, it will not be reliable. I will explain this soon. The list of additional parameters that are automatically tracked together with the form events are: form_id.HTML id attribute of the <form> DOM element. form_name. HTML name attribute of the <form> DOM element. form_destination. URL to which the form is being submitted. form_submit_text. This parameter is available only with the form_submit event. It will contain the text of a form submit button. As I have said, this event is often unreliable, and I would not recommend using form tracking of enhanced measurement. It won’t be able to track AJAX forms It might track an event when the form was submitted unsuccessfully (e.g., when a required field is left blank) I recommend building a custom form-tracking solution with Google Tag Manager instead. Final words regarding Enhanced Measurement in GA4 Enhanced Measurement is a nice little time-saver when configuring events in Google Analytics 4. However, I would not use every single feature in that suite. What I always use: File download tracking Outbound link clicks Site search What I rarely use (or don’t use at all): Video engagement (because it does not work on many websites). I’d rather do that with GTM. Scroll (I always have mixed feelings here. At the moment of writing this blog post, I actually have scroll tracking implemented on my blog + enhanced it with additional events with GTM, but that is just for playing around with GA4. But on real projects, it’s always a topic for discussion.) Form interactions. I never use that because of its unreliability. I also haven’t yet decided what to do with History change events automatically tracked by Enhanced Measurement. If your URL contains #, you will still need to configure virtual pageview tracking in GTM manually. And what about other cases? Time will show. I’ll keep an eye on it to see if it’s worth taking a shot.","metadata":{"source":"https://www.analyticsmania.com/post/enhanced-measurement-in-google-analytics-4-the-guide/","title":"Enhanced Measurement in Google Analytics 4: The Guide","date":"2023-02-08T01:22:16+00:00","contentLength":3337}},{"pageContent":"Updated: January 23rd, 2023. The Data Layer is the foundation on which Google Tag Manager heavily relies. It ensures maximum flexibility, portability, and ease of implementation. In my other blog post, I have explained how it works and how you can get the most out of it. However, not all aspects were covered there. Since data can be saved using different structures, it should be accessed differently, as well. In today’s blog post, I’ll explain three ways how you should pull data from the data layer. Although all three methods include Data Layer Variable that can be created in the Google Tag Manager container, their settings will differ slightly. If you have read my guide about GTM Preview and Debug mode, you already know that the Data Layer tab is the most undervalued and totally untapped part of the GTM debug console, which is forgotten by beginners and (especially) intermediate users. This tab shows the same message object as it was pushed to the data layer for the selected event and what the data layer looks like after the message transaction is complete. In other words, you can see all data that is currently available in the data layer and what values were available after every Google Tag Manager event. And the best part: every data point (pushed to the data layer) can be turned into a variable in Google Tag Manager. Table of Contents – Hide table of contents – Before we continue #1. Accessing first-level keys (a.k.a. primitive values) #2. Pull the data from child keys (a.k.a. nested fields) #3. Pull the data from array members Final words Before we continue: this topic is also thoroughly explained in the Intermediate GTM Course In this blog post, you’ll take a glimpse at 3 data types in JavaScript: strings, objects, and arrays. However, if you want to dive deeper and properly understand how they work in GTM, enroll in my Intermediate Google Tag Manager course. <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2021/05/Enroll-in-Intermediate-GTM-course-in-content-banner.jpg\" alt=\"Enroll in Intermediate Google Tag Manager course\" /> #1. Accessing first-level keys (a.k.a. primitive values) You’re probably asking why did I call them “first-level keys”? I’ll explain that at the end of this chapter. For my WordPress blog, I’m using GTM4WP plugin, which pushes some keys and values with each page load: Key: pagePostType, value: post Key: pagePostType2, value: single-post Key: pageCategory, value: google-tag-manager-tips Key: pagePostAuthor, value: Julius Fedorovicius See the screenshot below. <img class=\"aligncenter wp-image-20795\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-1.png\" alt=\"\" width=\"470\" height=\"260\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-1.png 1028w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-1-300x166.png 300w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-1-768x424.png 768w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-1-1024x566.png 1024w\" sizes=\"(max-width: 470px) 100vw, 470px\" /> With the help of Google Tag Manager, I can easily turn each of them into data layer variables and reuse them in other tags. <img class=\"aligncenter wp-image-20208\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/01/data-layer-variable.jpg\" alt=\"\" width=\"496\" height=\"589\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/01/data-layer-variable.jpg 678w, https://www.analyticsmania.com/wp-content/uploads/2022/01/data-layer-variable-253x300.jpg 253w\" sizes=\"(max-width: 496px) 100vw, 496px\" /> Say you want to send a Google Analytics event when someone leaves a comment. With every event, you also want to push the article author’s full name. This way, you’ll see which authors drive the highest reader engagement. In this example, I will not go into details on how to create a tag, as I will only demonstrate how to pull data from the data layer and turn it into a variable (within Google Tag Manager). In the Google Tag Manager account, you should go to Variables and create a new one with the following settings (dlv stands for data layer variable): <img class=\"aligncenter wp-image-20796\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-26.jpg\" alt=\"\" width=\"379\" height=\"509\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-26.jpg 505w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-26-223x300.jpg 223w\" sizes=\"(max-width: 379px) 100vw, 379px\" /> That’s it! Save this variable, refresh Preview and Debug (P&D) mode, and refresh the website you’re working on. You should then see your newly created variable in the Variables tab of P&D console. Oh, I almost forgot. You’re probably still thinking, why did I call it “First-level key”? Well, that’s because all those four keys have no parent keys. Let me illustrate. Here’s an example where the key is on the first level. { pagePostAuthor: 'Julius Fedorovicius' } And here’s 2nd level key because pagePostAuthor is a descendant of attributes key: { attributes: { pagePostAuthor: 'Julius Fedorovicius' } } In the next chapter, I’ll explain how you can pull data from the data layer if the key is not on the first level. #2. Pull the data from child keys (a.k.a. nested fields) Let’s try to put this as non-technical as possible: when keys are descendants of other keys, they are called child keys (to be honest, I’ve found various terms on this one, but child key sounds the most comprehensible for non-developers). In the example below, you can see that attributes are at the first level, and pagePostAuthor is on the 2nd. { attributes: { pagePostAuthor: 'Julius Fedorovicius' } } To pull its value, you should slightly change one setting in a variable (within Google Tag Manager). Instead of pagePostAuthor, you should enter attributes.pagePostAuthor as Data Layer Variable Name. <img class=\"aligncenter wp-image-20797\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-15.jpg\" alt=\"\" width=\"385\" height=\"426\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-15.jpg 471w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-15-271x300.jpg 271w\" sizes=\"(max-width: 385px) 100vw, 385px\" /> What if pagePostAuthor also had a child key? What would you do? { attributes: { pagePostAuthor: 'Julius Fedorovicius': { someOtherKey: 'example' } } } The answer is: <img class=\"alignnone size-full wp-image-2092 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2017/06/a88.jpg\" alt=\"Inception we need to go deeper\" width=\"600\" height=\"339\" /> That’s right. You should define the full path to that particular key: attributes.pagePostAuthor.someOtherKey, and so on… and so on… A dot should separate every level. Accessing child keys in the data layer is pretty standard. When someone asks me to give an example, I always tell them about the AJAX listener, which helps to track AJAX form submissions. In my blog post, Google Tag Manager AJAX form tracking, I’ve explained how to use AJAX listener (by Bounteous). It listens to all AJAX requests and pushes their data to the data layer. Here’s an example: <img class=\"aligncenter size-full wp-image-20799\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-3-1.jpg\" alt=\"\" width=\"801\" height=\"565\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-3-1.jpg 801w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-3-1-300x212.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-3-1-768x542.jpg 768w\" sizes=\"(max-width: 801px) 100vw, 801px\" /> There are a lot of nested keys. To pull data from the data layer, you’ll need to use dot notation in the data layer variable’s settings, e.g., attributes.response. <img class=\"aligncenter wp-image-20800\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-2.jpg\" alt=\"\" width=\"360\" height=\"442\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-2.jpg 554w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-2-244x300.jpg 244w\" sizes=\"(max-width: 360px) 100vw, 360px\" /> #3. Pull the data from array members I was working with a developer on implementing Google Analytics Ecommerce tracking . Following Google’s guidelines, I asked a developer to push successful order data to the data layer. Then, I could fetch that event (and its data) with a GA4 event tag within Google Tag Manager. It’s essential that the developer follows guidelines and pushes data using the structure as instructed by Google. Here’s the official example from their knowledge base: window.dataLayer = window.dataLayer || []; window.dataLayer.push({ event: 'purchase', ecommerce: { transaction_id: 'T_12345', affiliation: 'Google Merchandise Store', value: 25.42, tax: 4.90, shipping: 5.99, currency: 'USD', coupon: 'SUMMER_SALE', items: [ { item_id: 'SKU_12345', item_name: 'Stan and Friends Tee', item_category: 'Apparel', price: 9.99, quantity: 1 }, { item_id: 'SKU_12346', item_name: 'Google Grey Women's Tee', item_category: 'Apparel', price: 20.99, quantity: 1 }] } }); “You know what?” I asked myself, “This is very useful information”. I’d also want to push this order data to other marketing tools I’m using (e.g., Facebook Pixel). I was mostly interested in price, name, and quantity. So I tried Method #2 (from this blog post) and failed. I used ecommerce.price, ecommerce.item_name, etc., but my newly created data layer variables always returned undefined. So what’s wrong? <img class=\"aligncenter size-full wp-image-20801\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-6.png\" alt=\"\" width=\"1122\" height=\"285\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-6.png 1122w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-6-300x76.png 300w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-6-768x195.png 768w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-6-1024x260.png 1024w\" sizes=\"(max-width: 1122px) 100vw, 1122px\" /> Notice anything suspicious? In my GA4 Ecommerce example (taken from Google’s Knowledge Base), there are 2 item_name keys, 2 price keys, etc. So how the heck can Google Tag Manager know which value I am interested in? The first or the second one? And what would happen if a user purchased 5 products? What we are dealing here with is called arrays. The ecommerce.items has an array containing two products with the same collections of keys: item_id, item_name, item_category, price, quantity. In Javascript, if you want to pull the value of the first product’s price, you’d need to use ecommerce.items[0].price (the index starts from 0), but Google Tag Manager’s data layer variable does not support square brackets in this context, so you’d need to use dot notation, like this: ecommerce.items.0.price. In Google Tag Manager, your data layer variable should look like this: <img class=\"aligncenter size-full wp-image-20802\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-4-1.jpg\" alt=\"\" width=\"700\" height=\"702\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-4-1.jpg 700w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-4-1-150x150.jpg 150w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-4-1-300x300.jpg 300w\" sizes=\"(max-width: 700px) 100vw, 700px\" /> <img class=\"aligncenter wp-image-20803\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-7-1.jpg\" alt=\"\" width=\"376\" height=\"464\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-7-1.jpg 553w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Screenshot-7-1-243x300.jpg 243w\" sizes=\"(max-width: 376px) 100vw, 376px\" /> If there were five products in the array and you wanted to access the price of the 5th product, the Data Layer Variable name should be ecommerce.items.4.price. Remember, the index here starts from zero, so the first product is actually not the 1st, but the 0th. Final words on pulling data from the Data Layer Since data can be saved using different structures, it should be accessed differently, as well. Now, you know how to pull data from the data layer in 3 different ways. Although they all use the same Data Layer Variable, their names are different, which depend on the data structure – arrays, nested keys, or single (first-level) keys.","metadata":{"source":"https://www.analyticsmania.com/post/pull-data-from-data-layer-google-tag-manager-tutorial/","title":"3 Ways to Pull Data from Data Layer with Google Tag Manager","date":"2023-01-23T08:05:08+00:00","contentLength":2109}},{"pageContent":"Updated: April 6th, 2023. Google Tag Manager is an amazing tool. Need to add a particular tracking pixel to a website? Not a problem! Want to track submissions of a newly created form? Consider it done. All thanks to GTM. Instead of waiting (for days) for a busy developer to add those tracking codes, you could do this by yourself (well, in many cases). Even though you will not replace developers 100% (and, in fact, you never should), with Google Tag Manager, you (and your team) will become much agiler in implementing new marketing campaigns and/or web analytics tracking. But where should you start? Tag Manager looks like a tank that requires some very specific knowledge and your regular driver’s license won’t help much here. Just like any other tool, GTM has its own learning curve. That’s why I decided to create this Google Tag Manager tutorial. It’s the first step towards becoming more independent + having more control over your analytics/marketing tracking codes. Ready? Let’s start. If you have some questions about GTM, feel free to post a comment. By the way, I’ve prepared a free Google Tag Manager ebook containing even more useful information so if you’re serious about learning GTM, go ahead and download it. <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2019/07/Google-tag-manager-for-beginners-ebook.jpg\" alt=\"Subscribe and Get the Ebook - Real Book Img - GTM for Beginners\" /> Table of Contents + Show table of contents + Before we continue: The Pre-Tag-Management World What is Google Tag Manager? Google Tag Manager vs Google Analytics Top benefits of Google Tag Manager Fast Deployment of Tracking Codes All Tags Are Controlled in a Single Place, your GTM account Built-in and 3rd Party Testing Tools Fairly simple event tracking Ready-made Tag templates How Does Google Tag Manager Work? Create a Google Tag Manager Account How to Install Google Tag Manager? How to check if Google Tag Manager is working? Creating Your First Tag in Google Tag Manager Save the tag Testing with GTM Preview Mode and GA4 DebugView Publishing the Google Tag Manager Container So what’s next? What should you do now? If you need to become a GTM professional as fast as possible What should you learn next after you read this Google Tag Manager tutorial? Frequently Asked Questions Final words Video tutorial If you prefer to learn from the video content, I have recorded a Google Tag Manager tutorial and published it on YouTube. To get started, click on the video player below or click this link. Note: GA4 interface has slightly changed since I recorded this video. Debugview is not located at Admin > Debugview. Before we continue: The Pre-Tag-Management World Before we dive deeper into what Google Tag Manager is, let’s take a quick look at the world we used to live in (a.k.a. “without tag management”). Whenever you want to install Google Analytics or some other web tracking tool, it prompts you to add a piece of their JavaScript code (a.k.a. tag) on your website. Pretty standard, right? It can be Hotjar, Google Analytics, or some other tool, but they all ask you to add their code (tag) to your site. When a visitor lands on your website, that tracking code is also loaded. Therefore, a visitor is tracked. Adding that one tag to a site isn’t big of a deal. You just ask a developer, and he/she will do that (sometimes on the same day, sometimes over several days, but still reasonable because this has to be done only once). But here’s the catch. Out of the box, GA4 offers plenty of metrics and some automatic event-tracking capabilities. But to make really good and thoughtful decisions, you need to track much more: interactions (e.g., form submissions), sales, etc. This means that more tracking codes must be added to a website. And usually, this is not just a “one-time project”. You must constantly add new tracking codes and modify/remove the current ones. That’s where the developer (and the IT department) becomes a bottleneck. Since he/she is working on his own tasks/projects, marketing/analytics tasks often are a B priority. Therefore, you and your team have to wait. And wait a bit more. And more. <img class=\"aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2019/01/The-old-process.png\" width=\"663\" height=\"265\" /> That’s where the GTM saves the day, and this Google Tag Manager tutorial will show you how. What is Google Tag Manager? Google Tag Manager is a tag management solution that is a middleman between a website and marketing/analytics tools. All you need to do is to add your tracking codes to GTM and then configure rules when they should be activated(on page load, click, form submission, etc.). Imagine that Tag Manager is a Toolbox where you keep all your tools: a ruler (Google Analytics), a hammer (Google Ads), etc. Google Tag Manager also lets you test your tracking tags to ensure they are triggered when you load a page or click a particular button. Another great benefit: you can change your tags and how they work without actually changing the source code of your website. Instead, you just edit tags in the GTM user interface and publish changes with a button click. <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2019/07/Google-tag-manager-for-beginners-ebook.jpg\" alt=\"Subscribe and Get the Ebook - Real Book Img - GTM for Beginners\" /> Google Tag Manager vs Google Analytics Many beginners confuse Google Analytics with Tag Manager by asking which one they should use now. The answer is both. These two tools do not replace each other, they work together. Google Analytics is a tool that collects visitor data and displays it in various reports, while Google Tag Manager is responsible for activating tools like GA4. To summarize, Google Tag Manager lets you manage various Javascript tracking codes (a.k.a. Tags) on your website. Google Analytics tracking code is one of those tags. If you still feel confused about the relationship between Google Analytics and GTM, read this guide or watch the video below: As I mentioned, Google Analytics is not the only tag compatible with Google Tag Manager. Other examples include: Google Ads Conversion Tag and Remarketing Tag. Facebook Pixel code Pinterest tag Any other custom HTML/Javascript code etc. Top benefits of Google Tag Manager There are many benefits of using Google Tag Manager, but I’d like to point out, in my opinion, the most important ones. REASON #1. Fast Deployment of Tracking Codes Instead of having to wait days or weeks for a developer to implement your tracking codes, in many cases, you will be able to do it by yourself (without actually editing the website’s code). <img class=\"alignnone wp-image-2979 size-full\" src=\"https://www.analyticsmania.com/wp-content/uploads/2017/09/New-way-vs-Old-way-Tag-Management.png\" alt=\"New way vs Old way - Tag Management - Google Tag Manager tutorial for beginners\" width=\"914\" height=\"429\" /> REASON #2. All Tags Are Controlled in a Single Place, your GTM account In the past, all tags were coded directly in the website’s/app’s source code. The worst part, those little pieces of JavaScript code snippets were scattered across different website files. So if you need to make a change, the developer most likely needs to: (1) find all those codes, (2) update them. I’ve seen many cases when due to a human error, some codes were missed. Therefore this caused inaccuracy in data collection. Thanks to Tag Manager, this process is made easier: all tags are controlled in one place. <img class=\"alignnone wp-image-8240 size-full\" src=\"https://www.analyticsmania.com/wp-content/uploads/2019/05/tags.jpg\" alt=\"List of tags - Google Tag Manager tutorial\" width=\"1138\" height=\"463\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2019/05/tags.jpg 1138w, https://www.analyticsmania.com/wp-content/uploads/2019/05/tags-300x122.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2019/05/tags-768x312.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2019/05/tags-1024x417.jpg 1024w\" sizes=\"(max-width: 1138px) 100vw, 1138px\" /> REASON #3. Built-in and 3rd-Party Testing Tools Troubleshooting and correcting tag errors is simplified via Tag Manager’s Preview and Debug mode, which shows which tags are fired on a page and which are not. It also includes information about triggers that fire tags and data contained within tracking tags. <img class=\"alignnone size-full wp-image-14542\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-27T154147.005.jpg\" alt=\"\" width=\"1185\" height=\"675\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-27T154147.005.jpg 1185w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-27T154147.005-300x171.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-27T154147.005-768x437.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-27T154147.005-1024x583.jpg 1024w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-27T154147.005-440x250.jpg 440w\" sizes=\"(max-width: 1185px) 100vw, 1185px\" /> Why is it important? With Google Tag Manager debugging solutions, you’re ensuring your tags work before you publish them to the live site. Also, let’s not forget other useful browser extensions such as Tag Assistant, Data Layer Inspector, etc. I’ve listed many more of them in a blog post called Top Google Tag Manager Extensions for Chrome. Still not convinced? Continue reading this Google Tag Manager tutorial, and I’ll show you the goldmine. REASON #4. Fairly simple event tracking As I have mentioned before, event tracking involves custom JavaScript codes that a developer has to add to a website to track events like clicks, form submissions, etc. To make things easier, Google Tag Manager comes with a feature called auto-event tracking. Once you enable a certain trigger in Tag Manager, it will start automatically listening to particular website interactions. There is still some setup required, but it is relatively straightforward to do. You can use those interactions to fire tracking codes, e.g. GA Event Tag. Basic events that you can track (by default) in Google Tag Manager are based on: Clicks Link clicks Form submissions, etc. But wait, there’s more! Thanks to the growing community of GTM users and enthusiasts, the number of auto-event tracking functions constantly increases. You can also add custom features that record things, such as video players and much more. Just keep in mind that more complex events still might require a developer’s input. Although Google Tag Manager gives you some superpowers, it doesn’t make you almighty. REASON #5. Ready-made Tag templates Google Tag Manager has several important built-in tags for Google Analytics 4, Google Ads conversions, remarketing, and more. This allows a marketer with little or no coding knowledge to customize tags without implementing complicated code or asking for a developer’s help. <img class=\"wp-image-14695 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155652.958.jpg\" sizes=\"(max-width: 392px) 100vw, 392px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155652.958.jpg 467w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155652.958-191x300.jpg 191w\" alt=\"\" width=\"392\" height=\"616\" /> And if you cannot find a tag template you need, check the community gallery where other members are building super-useful stuff. Or as an alternative, you can use a Custom HTML tag. If you still have some doubts about whether you should start using Google Tag Manager, here are some additional posts tailored to you: Google Tag Manager benefits Things you can do with Tag Manager (A LOT of them) How Does Google Tag Manager Work? For beginners, there are three concepts to understand: tags, triggers, and variables. A tag is a piece of code that must be fired on a website under certain circumstances. It can be a tracking code, some piece of code that changes the text or a particular website element, or even code that changes the color of the browser’s address bar, you name it. When you create a tag, you basically instruct Tag Manager to “do this”, “do that”, “track page views of this visitor”, “track this click and send to Google Analytics”, etc. A trigger is a condition when a tag must fire. Should a tag fire on all page views? Or maybe on certain clicks? How about successful form submissions? All of these examples are triggers. When a particular condition (or a set of conditions) is met, a trigger is activated and all the tags (linked to it) are dispatched. A variable is the final member of this trinity. Variables are little helpers that can be used in tags, triggers, or even in other variables. A variable can: hold a single piece of data (like page URL, website domain, product ID, ta ext of a link, etc.) hold a set of data/settings (GA settings variable (for Universal Analytics) contains multiple settings related to GA, like Tracking ID, Display Advertising settings, etc.) be a complex function (but this one is too advanced for beginners, therefore, let’s skip it, at least for now), etc. <img class=\"aligncenter wp-image-5185\" src=\"https://www.analyticsmania.com/wp-content/uploads/2018/08/Tags-triggers-variables.jpg\" alt=\"Relationship between Tags, triggers, variables - Google Tag Manager tutorial\" width=\"450\" height=\"267\" /> The best way to understand the relationship among tags, triggers, and variables in Google Tag Manager is to take a look at an example (see the image below). <img class=\"aligncenter wp-image-5186\" src=\"https://www.analyticsmania.com/wp-content/uploads/2018/08/Tags-Triggers-Variables-in-GTM.jpg\" alt=\"Tags, Triggers, Variables in GTM - Google Tag Manager tutorial\" width=\"500\" height=\"302\" /> Google Ads Conversion Tag is a tag. With it, you instruct the Google Tag Manager to do what? Track a conversion. When must this tag be fired? The answer is On a Thank You Page (a.k.a. order confirmation page). This condition is our trigger. Now, we need to use some additional information to send more precise data to Google Ads and to make our trigger actually work. With Google Ads conversion tag, we can send Order Total, which is a variable. Whenever a successful purchase is complete, the G Ads tag will fetch the value of the variable Order Total and send it over to Google’s servers. Variables are things that make Google Tag Manager tracking dynamic. In the trigger, we need to precisely instruct Google Tag Manager when to fire. Saying on a Thank You page is comprehensible for a human. But in Tag Manager, we need to be more specific. What is a Thank You page? The answer: it’s the page of which the Page URL contains “/purchase-successful/” (P.S. this is just an example). In this case, the Page URL is a variable, and we have instructed GTM to constantly check the Page URL when the page loads. If a variable (URL) contains “/purchase-successful/”, the trigger will be activated. So as you can see, variables can be used in both Tags and Triggers. You can also use them in other variables, but you’ll learn that in the future (not in this guide). Create a Google Tag Manager Account To get started, first, let’s create a GTM account. Go to Google Tag Manager’s official website and click the main call-to-action to create a new GTM account. <img class=\"wp-image-5233 size-full aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2018/08/GTM-landing-page-2.jpg\" alt=\"create google tag manager account\" width=\"800\" height=\"417\" /> Like any other Google product, you will use the same Google account for Tag Manager. So if you’re already on Gmail (Google Ads, Google Analytics, etc.), you will be automatically logged in to Google Tag Manager. If not, create a Google account first (I will not show that procedure, so you’re on your own here 🙂 ). Once you log in, you’ll be asked to create a new GTM account and a new container. In the Account Name field, enter the name of the business (e.g., your company’s business or your client’s business). If you are an agency, it is a better practice to ask your client to create a GTM account and then share the access with you. In the Container Setup section, enter the name of your website (it can be a domain (e.g., example.com) or just a name (e.g., My website). In this blog post, we will cover Web tracking, thus choose Web as the target platform. <img class=\"size-full wp-image-14561 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-28T105153.449.jpg\" alt=\"\" width=\"757\" height=\"822\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-28T105153.449.jpg 757w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-28T105153.449-276x300.jpg 276w\" sizes=\"(max-width: 757px) 100vw, 757px\" /> The Google Tag Manager account works the same as the GA account. Usually, it’s for a company/business/client, while a container is usually for a website or application. A single container can contain many tags, triggers, and variables. However, if several websites belong to a single business and their structure is very similar (plus, their tracking implementation is similar), feel free to use one container on multiple websites. How to Install Google Tag Manager? After you create a container, you’ll get two codes that must be added to a website. Hand over these two snippets to a developer and ask him/her to carefully follow the instructions (the first code should be added somewhere in the <head> of a website, while the second should be added right after the opening <body> tag). <img class=\"alignnone wp-image-8243 size-full\" src=\"https://www.analyticsmania.com/wp-content/uploads/2019/05/install-gtm.jpg\" alt=\"GTM container snippet - Google Tag Manager tutorial\" width=\"870\" height=\"590\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2019/05/install-gtm.jpg 870w, https://www.analyticsmania.com/wp-content/uploads/2019/05/install-gtm-300x203.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2019/05/install-gtm-768x521.jpg 768w\" sizes=\"(max-width: 870px) 100vw, 870px\" /> Thanks to this code (implemented on a page), all the tags will be fired when they are configured to do so. If you want to learn more about the proper installation, read this guide on how to install Google Tag Manager on a website. If you’re using a popular content management system, like WordPress, chances are that there is a ready-made GTM plugin that eases the installation process + adds some additional benefits. For example, in WordPress, there is an awesome plugin GTM4WP. Not only will it help you easily install Google Tag Manager, but also you can get some additional data from it, like page author, page tags, etc. Later, this data can be turned into GTM variables and used in tags and triggers. <img style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" class=\"alignnone size-full wp-image-4961\" src=\"/wp-content/uploads/2019/06/700px-Subscribe-and-Get-the-Bundle-smaller.jpg\" alt=\"Google Tag Manager Ebook Bundle\" width=\"1236\" height=\"500\" /> Feeling tired? If yes, bookmark this Google Tag Manager tutorial for beginners and come back any time later when you’re ready to dive into the world of tag management. How to check if Google Tag Manager is working? After the GTM code is implemented on a page, you need to make sure whether it was actually properly installed. There are several options you can choose from (all of them are explained in detail here). The easiest one: Enable preview and debug mode and see whether it appears on the screen. Click the Preview button in the top right corner of the GTM interface, then go to the website (refresh it) and check whether a GTM preview mode works. The tips above are the main ones you could try right now. I have a longer (and more detailed) list here (in case you need it). Creating Your First Tag in Google Tag Manager Usually, the first tag marketers/web analysts install with Google Tag Manager is the basic Google Analytics 4 tracking. This is equivalent to the procedure where GA4 asks you to add their gtag tracking code snippet to all website pages. But instead, we’ll choose a more flexible road, GTM. To get started, go to analytics.google.com. Then go to the Admin section of your Google Analytics interface (by clicking the Admin at the bottom-left corner) and then (in the Property section) click Create Property. <img class=\"size-full wp-image-14876 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/create-google-analytics-4-property.jpg\" sizes=\"(max-width: 921px) 100vw, 921px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/create-google-analytics-4-property.jpg 921w, https://www.analyticsmania.com/wp-content/uploads/2020/11/create-google-analytics-4-property-300x229.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/create-google-analytics-4-property-768x585.jpg 768w\" alt=\"\" width=\"921\" height=\"702\" /> Then enter the name of your property. It might be the name of your website, of your company, a brand, etc. Choose your company’s country, reporting time zone, and the main currency that your business operates in. <img class=\"alignnone size-full wp-image-21586 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture3.jpg\" alt=\"\" width=\"562\" height=\"335\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture3.jpg 562w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture3-300x179.jpg 300w\" sizes=\"(max-width: 562px) 100vw, 562px\" /> Then press Next, and answer several questions. Then you will need to select your business objectives. Based on these choices, the reports that you will have in the interface will change too. To make things simpler right now, select Get baseline reports. <img class=\"alignnone wp-image-21587 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture4.jpg\" alt=\"\" width=\"473\" height=\"195\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture4.jpg 539w, https://www.analyticsmania.com/wp-content/uploads/2023/01/Picture4-300x124.jpg 300w\" sizes=\"(max-width: 473px) 100vw, 473px\" /> Click Create. The next step to complete is to configure your first data stream. It is a data source from which events will be sent to your Google Analytics 4 property. You can have multiple data sources in a single property. For example, three web properties, 1 for Android app, and 1 for an iOS app. In this blog post, I will focus on a Web stream. Select it. <img class=\"size-full wp-image-14878 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T222623.108.jpg\" sizes=\"(max-width: 1100px) 100vw, 1100px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T222623.108.jpg 1100w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T222623.108-300x146.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T222623.108-768x374.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T222623.108-1024x498.jpg 1024w\" alt=\"\" width=\"1100\" height=\"535\" /> Then enter the URL of your website (for example, https://www.mywebsite.com). Note that the protocol (https) is already selected. After that, enter the name of your website. When you create a web data stream in Google Analytics 4, you can enable/disable Enhanced Measurement. It is designed to help marketers get as many events in the reports as possible without the need to cooperate with developers or configure them in Google Tag Manager. <img class=\"size-full wp-image-14879 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T222747.220.jpg\" sizes=\"(max-width: 855px) 100vw, 855px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T222747.220.jpg 855w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T222747.220-300x220.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T222747.220-768x563.jpg 768w\" alt=\"\" width=\"855\" height=\"627\" /> When you’re ready, press the Create stream button. When you create a data stream (web), you will see a Measurement ID. <img class=\"alignnone size-full wp-image-14694\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155227.740.jpg\" sizes=\"(max-width: 1080px) 100vw, 1080px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155227.740.jpg 1080w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155227.740-300x120.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155227.740-768x308.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155227.740-1024x411.jpg 1024w\" alt=\"\" width=\"1080\" height=\"433\" /> In the top-right corner, you will see the tracking ID of your new property. Copy it. We’ll need to use it in Google Tag Manager. By the way, if you ever get lost in the GA4 interface and need to revisit this page, go to Admin > Data Streams > choose your most recently created stream, and then you will return to the same window I have displayed in the screenshot above. Then go to your Google Tag Manager container > Tags > New and choose GA4 configuration. In the Measurement ID field, enter the ID you copied in the GA4 interface. Keep the Send a page view event when this configuration loads if you want to track page views automatically. Usually, that’s ok keep it enabled. Still, in some situations, e.g., on single-page applications, it is recommended to disable the pageview checkbox and create a standalone configuration tag. You can read more about that here. In the Triggering section, select All Pages and then name the tag, e.g., GA4 Configuration – [measurement-id]. <img class=\"wp-image-14695 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155652.958.jpg\" sizes=\"(max-width: 392px) 100vw, 392px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155652.958.jpg 467w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T155652.958-191x300.jpg 191w\" alt=\"\" width=\"392\" height=\"616\" /> Save the tag That’s it! Save the tag. This is all you need to do with basic Google Analytics 4 implementation. If someone asks you to install the standard tracking with GA4, that is all you need to do, create a Configuration tag. It is the equivalent of adding that gtag tracking code (which is provided in the Admin section of GA property) to the website’s source code. Testing with GTM Preview Mode and GA4 DebugView Before we publish these changes and start tracking all the visitors, we must ensure everything is configured properly. That’s where the GTM Preview Mode becomes very useful (in fact, this is one of my favorite features in Google Tag Manager). Google Tag Manager Preview mode allows you to browse a site on which your GTM container code is implemented. To enable Google Tag Manager Debug mode, click the Preview button in the top right corner of your GTM interface (near Submit button). <img class=\"wp-image-14466 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151105.637.jpg\" sizes=\"(max-width: 316px) 100vw, 316px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151105.637.jpg 505w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151105.637-300x102.jpg 300w\" alt=\"\" width=\"316\" height=\"107\" /> Once you click the Preview button, a new browser tab will open with tagassistant.google.com. If it does not, read this guide. A popup there will ask you to enter the URL which you want to test and debug. It might be the address of a homepage, or it might be a specific page’s URL, and then press Start. <img class=\"wp-image-14467 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151634.626.jpg\" sizes=\"(max-width: 651px) 100vw, 651px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151634.626.jpg 979w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151634.626-300x195.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151634.626-768x499.jpg 768w\" alt=\"\" width=\"651\" height=\"423\" /> A new browser tab (or window) should appear where you will see the URL that you entered in the previous popup. At the bottom of that page/tab, you must see the following badge: <img class=\"wp-image-14465 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151005.451.jpg\" sizes=\"(max-width: 383px) 100vw, 383px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151005.451.jpg 534w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151005.451-300x99.jpg 300w\" alt=\"\" width=\"383\" height=\"127\" /> And if you go back to the tagassistant.google.com tab, you must see this success message. <img class=\"wp-image-14469 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151911.171.jpg\" sizes=\"(max-width: 709px) 100vw, 709px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151911.171.jpg 1081w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151911.171-300x141.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151911.171-768x361.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/10/image-2020-10-20T151911.171-1024x481.jpg 1024w\" alt=\"\" width=\"709\" height=\"333\" /> Click Continue in that popup, and you’ll see the Preview and Debug page (also known as the Debugger). If you want to learn more about the preview mode, watch this video. Once you enable the Preview mode, click Container Loaded event on its left side. This is the earliest moment when your tag might fire. Every time you set a tag to fire on All Pages, it actually means All Contained Loaded events. After you click on the Container Loaded, you should see your GA Configuration tag in the “Tags Fired” section. <img class=\" wp-image-14696 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T160016.378.jpg\" sizes=\"(max-width: 715px) 100vw, 715px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T160016.378.jpg 888w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T160016.378-300x224.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T160016.378-768x574.jpg 768w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-09T160016.378-627x470.jpg 627w\" alt=\"\" width=\"715\" height=\"535\" /> Great! Before we start celebrating your first tag, we need to check whether that data actually reached Google Analytics (because the fact that the tag was fired does not mean that data was properly sent. For example, a tag may be incorrectly configured and send page views to the wrong GA property). The primary feature built for debugging GA 4 data is the DebugView section. You can find it by going to Admin > DebugView on the left side of the GA4 interface. Click it. <img class=\"alignnone wp-image-20496 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3.jpg\" sizes=\"(max-width: 489px) 100vw, 489px\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3.jpg 592w, https://www.analyticsmania.com/wp-content/uploads/2022/10/image-3-300x213.jpg 300w\" alt=\"\" width=\"489\" height=\"348\" /> Do not mix this with the GTM Preview and Debug mode. They are two different beasts. To enable the debug mode in GA4, you have several options (any of them will work): Enable the GA debugger Chrome extension Send a debug_mode parameter together with an event Have enabled Google Tag Manager’s Preview mode on a page that you’re debugging But since we are working with Google Tag Manager, having the GTM Preview mode enabled automatically sets the debug_mode to true. Thus, the data will start appearing in the GA4 DebugView. When you start seeing data in the DebugView, you can click on every event, and then a list of parameters will be displayed. Click on that parameter to see the value that GA4 received. Now that is some granular debugging! <img class=\" wp-image-14881 aligncenter\" src=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T223340.391.jpg\" alt=\"\" width=\"719\" height=\"496\" srcset=\"https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T223340.391.jpg 846w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T223340.391-300x207.jpg 300w, https://www.analyticsmania.com/wp-content/uploads/2020/11/image-2020-11-14T223340.391-768x530.jpg 768w\" sizes=\"(max-width: 719px) 100vw, 719px\" /> Publishing the Google Tag Manager Container Once you’ve finished configuring and testing tags/triggers/variables in the container, publish it (otherwise, those changes won’t go live, and your visitors/users will not be tracked). Every time a container is published, a new container version of it is created. This is very useful because in the case of “oops….”, you can restore to one of the previous versions quickly. In the top right corner of the Google Tag Manager interface, click the blue SUBMIT button. <img class=\"aligncenter wp-image-8253\" src=\"https://www.analyticsmania.com/wp-content/uploads/2019/05/submit.jpg\" alt=\"\" width=\"200\" height=\"95\" /> Choose to Publish and Create Version. Although Version Name and Version Description fields are not required, it is highly recommended to fill them out. Once your container version history grows to 10, 20, or more versions, those names and descriptions will become very useful (when you’ll try to find out when a certain change was implemented). After that, once you hit the PUBLISH button, your changes will go live, and you will start tracking page views of visitors (and additional events if Enhanced Measurement is enabled). A quick offtopic. Do you enjoy this Google Tag Manager tutorial and found it useful? If yes, consider subscribing to my newsletter and further advance with GTM. So what’s next? What should you do now? My suggestion: start using Google Tag Manager on all new projects. The size does not matter, it might be a simple website, or it might be a larger e-commerce business. Even if you don’t plan to go advanced and just need the basic tracking, still use GTM. Google Tag Manager first, then GA4 Configuration tag. Because you never know, maybe one day you’ll suddenly need to track something that X project and you’ll be able to do that in no time (because Tag Manager will be already implemented there). But what about those projects/websites that already have some Google Analytics or other tracking tools implemented (not via Google Tag Manager)? There are a couple of options here: The most recommended: migrate all the hardcoded tracking scripts from the website’s source code to Google Tag Manager. This process is not easy and will require both your and the developer’s input, but in the long run, it will definitely pay off. Just think about how long were digital marketing campaigns delayed because the developer was busy with other projects/tasks. With GTM, you could implement tracking much faster, and you/your team would become much agiler. You can implement new tags with Google Tag Manager while old tags are still hardcoded (P.S. in this contest, “hard coded” means that tracking scripts are added directly to the website’s source code). Just make sure that you’re not tracking the same interactions with both hardcoded script and Google Tag Manager (otherwise, your data in reports will be duplicated). If you need to become a GTM professional as fast as possible This Google Tag Manager tutorial is just the first little step in learning how to master GTM. There are MANY more things that a beginner must learn. You have two options here: Take the long path and try to figure out the stuff on your own, read/watch countless GTM tutorials in random order, and connect the puzzle pieces on your own. Take a proven and shortest way + to get mentored. That’s where my Google Tag Manager Masterclass for Beginners is irreplaceable. In it, I will show you the correct (and shortest) path that a beginner should take to solve the most common web tracking challenges. And if you are even more serious about learning GTM, take a look at my intermediate/advanced course as well. What should you learn next after you read this Google Tag Manager tutorial? The list of Google Tag Manager topics that you can learn is definitely a long one but if you’re starting, here are my suggestions (some of these guides might still be using Universal Analytics as a tool of choice): Form tracking Video tracking Data Layer Click tracking Virtual page view tracking (on a Single Page Website) The list goes on (I’m just scratching the surface here). If Google Tag Manager were a narrow topic, I wouldn’t have published hundreds of GTM blog posts. But it’s totally possible to achieve, you’ll just need a lot of time, determination, and will to learn. Not sure where to start? Let’s learn how to track your first event with this video. Frequently Asked Questions about Google Tag Manager I bet that there are still a lot of questions in your head right now. That’s normal! Here are the most common ones. If you have more questions (that were not answered in this guide), feel free to leave a comment below. #1. Does Google Tag Manager work only with Google Products? No. Google Tag Manager plays well with a lot of platforms/tools. It offers a wide range of predefined tag templates (like Google Analytics, HotJar, Twitter Universal Tag, etc.). Additionally, you can add custom codes with the help of a Custom HTML tag. #2. Is Google Tag Manager free? GTM has both Free and Premium plans. A free plan is more than enough for small and medium businesses. Large enterprises can benefit from a paid Google Tag Manager 360 option. You can compare both pricing plans here. #3. What if my content management system does not allow me to place the Google Tag Manager code in the <head>? Don’t worry, this is not the end of the world. GTM <script> code can be placed anywhere on the website. The higher you put it in the website’s source code, the sooner it will load. Therefore your web tracking will be more precise. But if your CMS allows placing all codes only at in the <body> tag, that is still fine. The most important thing is that you must not place the <noscript> code in the <head> of a website. All other variations are allowed (e.g., both codes can be placed right after the opening <body> tag or both codes before the closing </body> tag). #4. Do I need to learn to code to use Google Tag Manager? No, but JavaScript, HTML, CSS, Regular Expression, DOM knowledge will be super useful and open an entirely new horizon of possibilities for you in web tracking with GTM. But even without these skills, you can achieve some great results. #5. Do I still need developers after I start using Google Tag Manager? It depends on what your goals are. Even though many new opportunities open to digital marketers after they start using GTM, sometimes a developer’s help is still necessary. Such interactions as video player actions, scroll tracking, element’s appearance on the screen, etc. will be pretty easy for you to track (as you get more experienced with GTM). But if you need some server-side data (which is not accessible by Google Tag Manager), for example, user ID, user’s pricing plan, you’ll need to cooperate with the developer. #6. Where can I get help regarding Google Tag Manager? Google Tag Manager Community on Facebook (recommended and the most active) Google Tag Manager Community on Reddit Official community forum Stack Overflow Google Tag Manager Tutorial: Final words GTM is one of my all-time favorite tools that has saved me a lot of time and helped me become agiler in digital marketing/web analytics. In this Google Tag Manager tutorial for beginners, you’ve learned that GTM is like a middleman between a website/app and 3rd party tools (e.g. Google Analytics, Google Ads, Facebook pixel). Back in the old days, all tracking codes (tags) were controlled by developers who had to add them to the website’s source code. This workflow caused several problems. To name a few: Developers were too busy, and marketers/web analysts had to wait days or even weeks to have their tracking scripts implemented. Multiple tracking codes meant they were scattered across different places on the website, which meant more difficulties in maintaining the code. Thanks to Google Tag Manager, adding, editing, and removing tracking scripts have become much easier. In a single interface, marketers can control codes (read: tracking tags) of various tools, like GA4, FB Pixel, etc. To make things much easier, the most popular tools can be controlled with the help of tag templates which do not require coding knowledge. Also, in this Google Tag Manager tutorial, I’ve explained what tags, triggers, and variables are in GTM, what their role is, and how they are connected. Tags are various pieces of code (or templates) that are activated under certain circumstances. Triggers are those conditions that activate tags. And variables are little helpers that can hold data (or some useful settings/functions) and can be inserted in tags, triggers, and even other variables. Prefer video content instead? Take a look at this tutorial on Youtube. <img class=\"alignnone size-full wp-image-5320\" style=\"border: #e2e1e1; border-style: solid; border-width: 1px; margin-top:30px; margin-bottom:40px\" src=\"/wp-content/uploads/2019/07/Google-tag-manager-for-beginners-ebook.jpg\" alt=\"Subscribe and Get the Ebook - Real Book Img - GTM for Beginners\" /> { \"@context\": \"https://schema.org\", \"@type\": \"FAQPage\", \"mainEntity\": [{ \"@type\": \"Question\", \"name\": \"What is Google Tag Manager?\", \"acceptedAnswer\": { \"@type\": \"Answer\", \"text\": \"Google Tag Manager is a free tool created by Google that allows you to control your tracking scripts in one place. \" } }, { \"@type\": \"Question\", \"name\": \"Does Google Tag Manager replace Google Analytics?\", \"acceptedAnswer\": { \"@type\": \"Answer\", \"text\": \"No. Google Analytics should be used together with Google Tag Manager. It is highly recommended to use GTM in order to control when certain Google Analytics tracking scripts should be activated.\" } }, { \"@type\": \"Question\", \"name\": \"Why should I start using Google Tag Manager?\", \"acceptedAnswer\": { \"@type\": \"Answer\", \"text\": \"There are multiple reasons. To name a few: 1. It allows you to implement tracking codes faster and in many cases, you don't have to wait for your IT department. 2. All your tracking scripts are controlled in one place. 3. Ready-made tag templates.\" } }, { \"@type\": \"Question\", \"name\": \"Does Google Tag Manager work only with other Google products?\", \"acceptedAnswer\": { \"@type\": \"Answer\", \"text\": \"No, Google Tag Manager supports various 3rd party tools, like Facebook Pixel, Hotjar, etc.\" } }] }","metadata":{"source":"https://www.analyticsmania.com/post/google-tag-manager-tutorial-for-beginners/","title":"Google Tag Manager Tutorial + Video & Free E-Book for Beginners","date":"2023-04-06T02:18:29+00:00","contentLength":7460}}]